{

    "HelpTitleMain_Ht01": "شروع‌به‌کار",
    "HelpTitleMain_Ht02": "فرایند رأی‌گیری",
    "HelpTitleMain_Ht03": " درستی و شفافیت انتخابات",
    "HelpTitleMain_Ht04": "ایجاد نامزدها و همه‌پرسی‌ها",
    "HelpTitleMain_Ht05": "پیام‌ها و تماس‌ها",
    "HelpTitleMain_Ht06": "امنیت و پیشنهادات",

    "HelpStart": "HelpStart",
    "Ht01": "Ht01",
    "Hp01_01": "تنیده چیست؟",
    "Hp01_01_": "تنیده یک اپلیکیشن غیرمتمرکز، امن و شفاف است که به کاربران این امکان را می‌دهد تا در نظرسنجی‌های مشروع برای انتخابات و رفراندوم‌ها شرکت کنند. این اپلیکیشن نبض پویا از احساسات اجتماعی ایجاد می‌کند و بینش‌ جامع اما لحظه‌ای از افکار عمومی ارائه می‌دهد. تنیده از یک سیستم پیام‌رسانی منحصر به فرد به صورت مشتری به مشتری (client-to-client) استفاده می‌کند که در آن آرا به طور مستقیم بین کاربران تبادل می‌شود و از این طریق حریم خصوصی و امنیت تضمین می‌شود.\n\nویژگی‌های کلیدی تنیده:\n\nرای‌گیری غیرمتمرکز:\nتنیده به سرورهای مرکزی متکی نیست. در عوض، تمام اطلاعات به طور مستقیم بین کاربران توزیع می‌شود. این ویژگی باعث می‌شود سیستم در برابر دستکاری و سانسور مقاوم باشد. برخلاف سیستم‌های سنتی که در آن آرا از طریق یک مرجع مرکزی پردازش می‌شود، در تنیده شرکت‌کنندگان به طور مساوی در نگهداری و توزیع شبکه مشارکت دارند. تنیده امکان تأیید مستقیم آرا توسط افراد را فراهم می‌کند. فرایند رای‌گیری به طور کامل باز، قابل تأیید و آزاد از کنترل‌های خارجی است. شما می‌توانید آرا را به طور کامل تأیید و شمارش کنید. به تمام داده‌ها دسترسی دارید تا آن‌ها را به تفکیک افراد تجزیه و تحلیل کنید و از دقت و شفافیت فرایند رای‌گیری اطمینان حاصل کنید.\n\nتکنولوژی ضد ربات:\nتنیده از اقدامات امنیتی برای جلوگیری از دستکاری آرا توسط ربات‌های خودکار استفاده می‌کند. تنیده از پروتکل‌های چندلایه برای اطمینان از اینکه فقط کاربران واقعی قادر به رأی دادن هستند، استفاده می‌کند. (جزئیات بیشتر در مورد این پروتکل‌ها در بخش سوالات متداول پیشرفته موجود است.) برای تأیید ادعای ضد ربات بودن سیستم، این سیستم به شما امکان تعامل با سایر رأی‌دهندگان را می‌دهد تا مشروعیت آن‌ها را تأیید کرده و از صحت آرا اطمینان حاصل کنید—بدون اتکا به نظارت مرکزی.\n\nحفاظت از حریم خصوصی:\nتمام ارتباطات در تنیده از طریق رمزگذاری انتها به انتها محافظت می‌شود و از چندین گره عبور داده می‌شود تا هویت شبکه و آدرس IP شما پنهان شود. هیچ نهاد واحدی—از جمله تنیده—نمی‌تواند تعاملات شما را ردیابی، رهگیری یا تغییر دهد. این امر محیطی کاملاً خصوصی و امن را تضمین می‌کند که در آن مشارکت شما ناشناس و غیرقابل دستکاری باقی می‌ماند.\n\nچطور کار می‌کند:\nبا تنیده، شما می‌توانید در انتخابات رأی دهید، نتایج را به‌صورت لحظه‌ای پیگیری کنید و حتی نظرسنجی‌های خود را ایجاد کنید. برای اضافه کردن یک کاندیدا یا رفراندوم جدید، باید امضاهای کافی از سایر کاربران از طریق اپلیکیشن جمع‌آوری کنید. این فرآیند تضمین می‌کند که تمام نظرسنجی‌ها مشروع، شفاف و مستقل از هر نوع گرایش یا اعمال سلیقه باشند. هر کاربر این اختیار را دارد که شفافیت آرا را بررسی کرده و مشروعیت هر یک از آن‌ها را تأیید کند. این فرآیند کاملاً باز است و شما قادر خواهید بود در هر زمان نتایج را بررسی و تأیید کنید.",
    "Hp01_02": "تنیده برای چه کسانی است؟",
    "Hp01_02_": "تنیده برای همه افرادی طراحی شده است که به شکل‌دهی آینده از طریق تصمیم‌گیری جمعی باور دارند. چه شما یک شهروند باشید که می‌خواهید صدای شما شنیده شود، چه مدافع تغییرات معنادار، یا کسی که به ارتباطات امن و غیرمتمرکز اهمیت می‌دهد، تنیده برای شما ساخته شده است.\n\nاین اپلیکیشن برای افرادی است که معتقدند نظرات آن‌ها می‌تواند مسیر جامعه را تحت تأثیر قرار دهد. تنیده سبک، کاربرپسند و به فضای بسیار کمی در گوشی شما نیاز دارد. حتی اگر علاقه اصلی شما استفاده از قابلیت پیام‌رسانی امن تنیده باشد، حضور شما از طریق توزیع و نگهداری اطلاعات از شبکه پشتیبانی می‌کند.\n\nشبکه تنیده با مشارکت کاربران خود زنده است. با آنلاین بودن، شما به پایداری سیستم کمک می‌کنید و صدای مردم را تقویت می‌نمایید. این اپلیکیشن بسیار کارآمد است و در ۲۴ ساعت استفاده مداوم تنها حدود ۳۵ مگابایت از داده اینترنت شما را مصرف می‌کند—کمتر از چند ویدیویی که هر روز در شبکه‌های اجتماعی مشاهده می‌کنید.\n\nاگر ایده‌های نوآورانه‌ای برای رفراندوم‌های تأثیرگذار یا معرفی کاندیداهای جدید دارید، تنیده به شما امکان می‌دهد که تفاوت ایجاد کنید. شما می‌توانید درخواست‌های آنلاین ایجاد کنید، امضا جمع‌آوری کنید و آن‌ها را در اپلیکیشن منتشر نمایید. (جزئیات بیشتر در بخش «افزودن کاندیداها و رفراندوم‌ها» ارائه شده است.) با تنیده، شما یک پلتفرم در اختیار دارید تا حمایت‌ها را سازمان‌دهی کنید، اهداف خود را تقویت کنید و صداها را در سطح جهانی انعکاس دهید.",
    "Hp01_03": "آیا درخواست‌های افشای داده را پردازش می‌کنید؟",
    "Hp01_03_": "در تنیده، حریم خصوصی شما اولویت اصلی ماست. تمامی پیام‌ها در داخل اپلیکیشن از رمزنگاری انتها به انتها و ارتباط فرد به فرد محافظت می‌شوند، به طوری که داده‌های شما تنها برای شما و گیرنده مورد نظر قابل دسترسی است. بنابراین هیچ ذخیره‌سازی داده مرکزی وجود ندارد و پیام‌های شما هیچ‌گاه خارج از تلفن شما ذخیره نمی‌شوند، که این امر خطر سوءاستفاده یا دسترسی غیرمجاز را از بین می‌برد.\n\nدر خصوص رأی‌گیری، تنیده از یک سیستم غیرمتمرکز استفاده می‌کند که در آن آراء بین تمام کاربران توزیع می‌شود. رأی شما به هویت واقعی، شماره تلفن یا آدرس IP شما مربوط نمی‌شود. این سطح از امنیت از طریق رمزنگاری تمامی ارتباطات و مخفی‌سازی آدرس IP شما از طریق چندین رله در شبکه حاصل می‌شود (جزئیات بیشتر در مورد استفاده از رله‌ها در بخش سوالات پیشرفته موجود است). بنابراین، رأی شما نمی‌تواند به شما مربوط شود مگر اینکه داوطلبانه آن را با دیگران به اشتراک بگذارید.\n\nاگر نگران درخواست‌های حذف داده یا درخواست‌های برداشتن اطلاعات هستید، باید بدانید که تمامی اطلاعات کاندیداها و رفراندوم‌ها در سراسر شبکه کاربری توزیع می‌شود و هیچ‌گونه گره مرکزی یا چندگانه‌ای برای ذخیره‌سازی وجود ندارد. این غیرمتمرکز بودن باعث می‌شود که حذف یا پاک‌کردن اطلاعات تقریباً غیرممکن باشد، چرا که نمی‌توان با هدف قرار دادن یک نقطه حیاتی، جریان داده‌ها را متوقف کرد. زمانی که اطلاعات به اشتراک گذاشته شد، عمومی می‌شود و نمی‌توان آن را پس گرفت مگر اینکه تمامی کاربران استفاده از اپلیکیشن را متوقف کنند.\n\nدر مجموع، تنیده اطمینان می‌دهد که داده‌های شما خصوصی، امن و مقاوم در برابر سانسور یا دستکاری باقی بماند. ما به شما این قدرت را می‌دهیم که به اطلاعات داخل شبکه تنیده دسترسی کامل داشته باشید و هیچ مرجع مرکزی قادر به دسترسی یا تغییر آن نخواهد بود. با استفاده از تنیده، حقیقت نمی‌تواند خاموش شود.",
    "Hp01_04": "مشارکت در تنیده",
    "Hp01_04_": "تنیده فقط درباره‌ی مشارکت نیست؛ بلکه درباره‌ی مالکیت مشترک پلتفرمی است که به هر کاربر قدرت می‌بخشد. مشارکت شما فراتر از رأی دادن، ایجاد نظرسنجی‌ها و شرکت در فرآیند دموکراتیک است. آینده‌ی تنیده به تلاش و اشتیاق جمعی کاربرانش وابسته است. هرچه بیشتر از آن استفاده کنید و آن را با دیگران به اشتراک بگذارید، تنیده قدرت بیشتری می‌گیرد و صدای شما بیشتر شنیده می‌شود. با افزایش تعداد آراء، تأثیرات نیز بیشتر می‌شود—کمک به ساختن چشم‌اندازی مشترک برای یک ایران دموکراتیک، جایی که هر فرد در شکل‌دهی آینده نقش ایفا می‌کند. هر رأی مهم است و هر کاربر تأثیرگذار.\n\nتنیده متعهد است که برای همه رایگان، در دسترس و امن باشد. این پلتفرم کاملاً بدون تبلیغات است و استقلال مالی ما باعث می‌شود که برنامه بر روی چیزی که مهم‌تر است متمرکز بماند—صدای شما. ما نمی‌خواهیم تبلیغات تجربه‌ی شما را مختل کنند و نمی‌خواهیم منافع شرکت‌ها کنترل این پلتفرم را به دست بگیرند. در عوض، برای حفظ و بهبود تنیده به حمایت کاربران متکی هستیم. اگر تمایل به حمایت از مأموریت ما دارید، ما شما را به اهدای کمک تشویق می‌کنیم. کمک‌های شما، چه کوچک و چه بزرگ، کمک می‌کند که تنیده بدون تبلیغات باقی بماند و به رشد و بهبود خود ادامه دهد.\n\nآدرس کیف پول مونرو : XMR :\n  86Qvk7RuZAQKHYzZk3EF8s9MNDPcGLrLg6sFpFgAnVyDJofMTdYTxoXd9SXKrDiBcUAxvJ3CPTfnyTYirjBXcvU51TCVD7b \n\nاما این پایان کار نیست. با رشد تنیده، پتانسیل ایجاد تغییر واقعی نیز افزایش می‌یابد. آینده در دستان ماست و از شما دعوت می‌کنیم که بخشی از این مسیر باشید. خبر رسانی کنید، دوستان خود را دعوت کنید و بیایید با هم چیزی معنادار بسازیم. با مشارکت شما، می‌توانیم آینده‌ای روشن برای ایران بسازیم.",
    "Ht02": "Ht02",
    "Hp02_01": "آدرس تنیده شما",
    "Hp02_01_": "آدرس تنیده شما یک شناسه‌ی منحصر به فرد است که مشابه سیستم‌های مبتنی بر بلاکچین عمل می‌کند. (برای جزئیات فنی بیشتر درباره‌ی رمزنگاری و منحنی استفاده‌شده، به بخش سؤالات پیشرفته مراجعه کنید.) این آدرس از دو بخش تشکیل شده است: یک \"آدرس عمومی\" با ۷۷ کاراکتر و یک \"رمز خصوصی\" با ۳۳ کاراکتر. این آدرس‌ها به صورت خودکار هنگام دانلود اپلیکیشن تولید می‌شوند. پس از باز کردن اپلیکیشن، می‌توانید یک آدرس جدید ایجاد کنید یا با استفاده از \"رمز\" خود به آدرس موجودتان وارد شوید. این ساختار مدیریت غیرمتمرکز و ایمن آدرس‌ها را بدون نیاز به مرجع مرکزی تضمین می‌کند.\n\nآدرس تنیده چگونه کار می‌کند\nآدرس عمومی شما در شبکه قابل مشاهده است و به‌عنوان هویت شما در سیستم غیرمتمرکز عمل می‌کند. این آدرس برای تأیید رأی‌های شما و ایجاد ارتباط با دیگر کاربران استفاده می‌شود. با اینکه آدرس عمومی است، به هویت واقعی شما متصل نیست و حریم خصوصی شما را تضمین می‌کند. اگر آدرس خود را با دوستانتان به اشتراک بگذارید، آن‌ها می‌توانند از طریق تنیده، بدون نیاز به اطلاعات شخصی مثل شماره تلفن، به شما پیام بدهند. با این حال، از آنجا که تمامی رأی‌ها شفاف و مرتبط با آدرس‌های عمومی هستند، انتخاب‌های رأی‌گیری شما برای دیگران قابل مشاهده خواهد بود.\n\nاز طرف دیگر، \"رمز\" خصوصی شما کاملاً محرمانه است و هرگز نباید به اشتراک گذاشته شود. این رمز مانند کلید اصلی حساب شما عمل می‌کند و به شما اجازه می‌دهد که در صورت گم شدن گوشی یا حذف اپلیکیشن، آدرس تنیده خود را بازیابی کنید. اگر رمز خود را از دست بدهید، دسترسی به آدرس و داده‌های مرتبط با آن به طور دائمی از بین می‌رود، زیرا هیچ‌کس، حتی تنیده، قادر به بازیابی آن نیست.\n\nدسترسی و ایمن‌سازی آدرس شما\nمی‌توانید آدرس عمومی و رمز خصوصی خود را در بخش \"تنظیمات\" اپلیکیشن مشاهده کنید. کاراکترهای آدرس و رمز شما از یک مجموعه ۶۰ کاراکتری تشکیل شده‌اند که شامل تمام اعداد و برخی حروف انگلیسی است، به جز \"O\" (اُ بزرگ) و \"I\" (آی بزرگ) برای جلوگیری از سردرگمی.\n\nبرای محافظت از رمز خود، می‌توانید در بخش تنظیمات، گزینه‌ای به نام \"گذرواژه\" را فعال کنید. هنگامی که این ویژگی فعال باشد، اپلیکیشن هر بار که بخواهید رمز خود را مشاهده کنید، یک گذرواژه ۴ رقمی از شما درخواست می‌کند. این ویژگی به صورت پیش‌فرض غیرفعال است، اما فعال کردن آن به شدت توصیه می‌شود. با این حال، اگر گذرواژه را فراموش کنید یا چهار بار آن را اشتباه وارد کنید، اپلیکیشن تمام داده‌های شما، از جمله آدرس و پیام‌هایتان را برای حفظ حریم خصوصی حذف خواهد کرد.\n\nبازیابی آدرس شما\nاگر گوشی خود را گم کنید یا اپلیکیشن را مجدداً نصب کنید، می‌توانید با وارد کردن رمز خود، آدرس تنیده را بازیابی کنید. این فرآیند بازیابی به صورت کامل در دستگاه شما و بدون نیاز به اتصال به اینترنت انجام می‌شود، که تضمین می‌کند فقط شما قادر به دسترسی به حساب خود هستید. اگر در زمینه رمزنگاری متخصص هستید، می‌توانید با استفاده از رمز خود آدرس را به صورت دستی بازسازی کنید. با این حال، اگر رمز خود را از دست بدهید، بازیابی آن غیرممکن است. همیشه رمز خود را در مکانی امن و محرمانه نگهداری کنید.\n\nنکات کلیدی\n- آدرس عمومی (۷۷ کاراکتر): قابل اشتراک‌گذاری و قابل مشاهده در شبکه؛ برای ارتباط و تأیید رأی‌ها استفاده می‌شود.\n- رمز خصوصی (۳۳ کاراکتر): غیرقابل اشتراک‌گذاری و ضروری برای بازیابی حساب. مانند یک کلید اصلی با آن رفتار کنید.\n- گزینه‌های امنیتی: برای جلوگیری از دسترسی غیرمجاز به رمز خود، از گزینه گذرواژه استفاده کنید.\n- از دست دادن غیرقابل بازگشت: از دست دادن رمز به معنای از دست دادن دائمی آدرس تنیده شما است.",
    "Hp02_02": "رأی اول، رأی دوم و ارقام",
    "Hp02_02_": "در بالای نوار ناوبری، بخش \"برگزیده\" را خواهید یافت. این بخش به انتخاب نامزدی اختصاص دارد که نماینده انتخاب مردم است. نامزدی که در صدر این بخش قرار دارد \"برگزیده\" است و صدای جمعی جامعه را نمایندگی می‌کند و بیشترین تعداد رأی‌ها را دارد.\n\nدر این بخش، دو نوع رأی وجود دارد: رأی اول و رأی دوم. نحوه کار آن‌ها به شرح زیر است:\n\nرأی دوم: می‌توانید این رأی را به هر نامزد در لیست بدهید و حمایت عمومی خود را نشان دهید.\n\nرأی اول: این رأی مختص دو نامزدی است که بیشترین تعداد رأی دوم را دارند. شما فقط می‌توانید رأی اول خود را به یکی از این دو نامزد بدهید. این مکانیزم تضمین می‌کند که نامزد برچسب‌خورده به‌عنوان \"برگزیده\" همیشه حداقل ۵۰ درصد از رأی‌های اول را داشته باشد.\n\nاین طراحی به شما اجازه می‌دهد تا با رأی دوم خود از نامزد موردنظر خود فعالانه حمایت کنید و به پیشرفت او در رتبه‌بندی کمک کنید. هم‌زمان، می‌توانید ترجیح خود بین دو رقیب اصلی را با رأی اول خود نشان دهید و در رقابت برای جایگاه برتر سهیم شوید. در نهایت، اگر نامزد شما به دو نفر برتر برسد، می‌توانید رأی اول و دوم خود را به همان فرد اختصاص دهید و جایگاه او را بیشتر تقویت کنید.\n\nبرای مشاهده اطلاعات دقیق در مورد یک نامزد، می‌توانید به صفحه پروفایل او بروید. در آنجا \"تعداد کل آراء\" را خواهید یافت که نشان‌دهنده تعداد کلی رأی‌های داده شده برای هر نوع رأی است. \"تعداد آراء\" و \"درصد\" سهم هر نامزد از کل آراء را نشان می‌دهند.\n\nدر بخش \"همه‌پرسی\"، سؤالات اجتماعی فعال نمایش داده می‌شوند. هر همه‌پرسی دو گزینه دارد و شما آزادید که به یکی از گزینه‌ها در هر تعداد از همه‌پرسی‌ها رأی دهید. این رأی‌ها به ثبت نظر جامعه در مورد موضوعات کلیدی در طول زمان کمک می‌کنند و به‌عنوان یک شاخص لحظه‌ای از اولویت‌های عمومی عمل می‌کنند، زیرا نظر جامعه با گذشت زمان تکامل می‌یابد.\n\nانتخابات برای \"برگزیده\" و برخی از رفراندوم‌ها تاریخ انقضا نخواهند داشت—این موارد به‌صورت مداوم نظر عمومی فعال و جاری را منعکس می‌کنند و به مردم امکان می‌دهند تا به شکلی استراتژیک آینده را شکل دهند و هم‌زمان با اولویت‌های متغیر جامعه در ارتباط بمانند.",
    "Hp02_03": "چگونه می‌توانم رأی بدهم؟",
    "Hp02_03_": "برای شروع فرآیند رأی‌دهی، ابتدا باید اطمینان حاصل کنید که تنیده در شبکه پایدار شده باشد. شما می‌توانید پیام وضعیت را در بالای موبایل در هنگام حضور در صفحه “خانه” بررسی کنید. اگر اپلیکیشن مشکلی در اتصال به شبکه گزارش داد، اتصال اینترنتی خود را بررسی کرده و مطمئن شوید که زمان گوشی شما حداقل  تقریبا به‌روز است، زیرا زمان دقیق برای معتبر بودن رأی شما ضروری است تا رأی شما توسط دیگر کاربران در شبکه پذیرفته شود. برای کاربران جدید، یک دوره انتظار ۳۰ ساعته لازم است تا بتوانند اولین رأی خود را ثبت کنند. پس از تثبیت در شبکه، می‌توانید برنامه را ببندید و پس از ۳۰ ساعت بازگردید تا رأی دهید، اما در این مدت از نصب مجدد اپلیکیشن خودداری کنید، زیرا این کار فرآیند تثبیت را از نو شروع می‌کند. این اقدام ایمنی تضمین می‌کند که هیچ‌کس نتواند سیستم را دور بزند و بیش از یک بار در طول عمر یک رأی رأی دهد (برای اطلاعات بیشتر به موضوع «چرا و چگونه رأی‌ها منقضی می‌شوند؟» مراجعه کنید).\n\nپس از پایدار شدن تنیده، به صفحه کاندیدا یا همه‌پرسی که می‌خواهید در آن رأی دهید بروید. پس از رأی دادن، اپلیکیشن رأی شما را با استفاده از آدرس منحصر به فرد شما در تنیده و زمان جاری امضا می‌کند (جزئیات این فرآیند در بخش \"پرسش‌های متداول پیشرفته\" آمده است). سپس رأی شما از طریق چندین لایه عبور داده می‌شود تا آدرس IP شما ناشناس بماند، و سپس به شبکه ارائه می‌شود. سایر کاربران در شبکه رأی شما را تأیید کرده و آن را پیگیری خواهند کرد.\n\nنتیجه ارسال رأی شما—اینکه آیا موفقیت‌آمیز بوده است یا نه—در پایین صفحه “خانه” نمایش داده می‌شود. ممکن است چند دقیقه طول بکشد تا نتیجه ظاهر شود، بنابراین مهم است که اتصال اینترنتی شما فعال باشد و اپلیکیشن را در حین این مدت باز نگه دارید (چه در زمینه و چه در پس‌زمینه). چون تنیده غیرمتمرکز است، هیچ سرور مرکزی وضعیت ارسال شما را ذخیره نمی‌کند. اگر ارسال رأی شما ناموفق باشد، اپلیکیشن به شما اطلاع می‌دهد و به شما اجازه می‌دهد دوباره تلاش کنید. با این حال، اگر قبل از دریافت بازخورد اتصال خود را از دست دهید، باید تا چرخه رأی‌دهی بعدی صبر کنید تا بتوانید دوباره رأی بدهید.\n\nپس از اینکه رأی شما در شبکه تثبیت شد، بین ۵ تا ۲۰ دقیقه طول می‌کشد تا در نتایج نظرسنجی‌ها منعکس شود. از این لحظه به بعد، حتی اگر شما آفلاین شوید، سایر کاربران رأی شما را حفظ خواهند کرد و اطمینان حاصل می‌کنند که رأی شما بخشی از شبکه باقی بماند. برای پشتیبانی از عملکرد روان اپلیکیشن، بهتر است آن را در پس‌زمینه با اتصال اینترنت فعال نگه دارید.\n\nپس از اینکه رأی شما به‌طور موفقیت‌آمیز منتشر و تثبیت شد، می‌توانید آن را با استفاده از آدرس منحصر به فرد خود در اپلیکیشن بررسی کنید. این ویژگی شفافیت را فراهم کرده و به شما امکان می‌دهد تا تأیید کنید که رأی شما به‌درستی ثبت شده است. برای جزئیات بیشتر، به بخش \"یکپارچگی انتخابات و شفافیت\" در مرکز راهنما مراجعه کنید.\n\nاین توضیح فرآیند ارسال رأی شما به شبکه را پوشش می‌دهد. با این حال، ملاحظات مهمی در مورد انقضای رأی‌ها وجود دارد که در موضوع بعدی \"چرا و چگونه رأی‌ها منقضی می‌شوند؟\" توضیح داده شده است.",
    "Hp02_04": "چرا و چگونه رأی‌ها منقضی می‌شوند؟",
    "Hp02_04_": "برنامه به گونه‌ای طراحی شده است که دارای اقدامات قوی ضد ربات باشد، اما ممکن است برخی کاربران همچنان تلاش کنند سیستم را دستکاری کنند. به عنوان مثال، رأی دادن از طرف دیگران (مانند استفاده از تلفن یکی از بستگان) یا رأی‌دهندگانی که تنها یک بار رأی داده‌اند و به مسائل اجتماعی جاری توجهی ندارند، می‌توانند یکپارچگی نظرسنجی‌ها را تحت تأثیر قرار دهند. برای مقابله با این موارد و حفظ مأموریت برنامه در بازتاب دقیق ترجیحات جامعه، رأی‌ها پس از ۳۰ ساعت منقضی می‌شوند. این کار تضمین می‌کند که نتایج معتبر باقی بمانند و نظرات عمومی به‌روز و مرتبط را منعکس کنند.\n\nهر رأی به طور متوسط ۲۴ ساعت اعتبار دارد و ۳۰ ساعت پس از ثبت منقضی می‌شود. شما یک بازه زمانی ۱۲ ساعته دارید، از ۱۸ تا ۳۰ ساعت پس از ثبت اولیه رأی، که می‌توانید رأی خود را بدون از دست دادن اعتبار آن تجدید کنید. به عنوان مثال، اگر رأی خود را ساعت ۳ بعدازظهر ثبت کنید، می‌توانید روز بعد از ساعت ۹ صبح تا ۹ شب آن را تجدید کنید. تجدید رأی در این بازه زمانی تضمین می‌کند که رأی شما معتبر باقی بماند و در نتایج نظرسنجی‌های جاری مشارکت داشته باشد.\n\nوقتی رأی خود را تجدید می‌کنید، یک چرخه جدید ۳۰ ساعته آغاز می‌شود. برای مثال، اگر رأی خود را ساعت ۴ بعدازظهر تجدید کنید، بازه زمانی بعدی شما برای تجدید رأی، روز بعد بین ساعت ۱۰ صبح تا ۱۰ شب خواهد بود. به خاطر داشته باشید که با تجدید رأی، رأی جدید یک دوره ۳۰ ساعته جدید را از زمان تجدید آغاز می‌کند.\n\nصفحه هر نامزد یا همه‌پرسی سه زمان کلیدی را نمایش می‌دهد:\n\n۱. زمانی که رأی شما برای اولین بار ثبت شده است.\n۲. زمانی که می‌توانید رأی خود را تجدید کنید.\n۳. زمانی که رأی جاری شما منقضی می‌شود، اگر تجدید نشود.\n\nهمچنین مهم است بدانید که رأی‌های جدید ممکن است ۵ تا ۲۰ دقیقه طول بکشد تا در شبکه پایدار شوند. با این حال، هیچ رأی مضاعفی شمارش نمی‌شود. هنگامی که رأی خود را تجدید می‌کنید، رأی جدید جایگزین رأی قبلی می‌شود و اطمینان حاصل می‌شود که در هر لحظه فقط یک رأی در سیستم منعکس می‌شود. برای اطمینان از تأثیر مداوم رأی شما بر نتایج کلی، مطمئن شوید که رأی خود را حداقل ۲۰ دقیقه قبل از زمان انقضا تجدید کنید.",
    "Ht03": "Ht03",
    "Hp03_01": "مشاهده آراء",
    "Hp03_01_": "در صفحه هر نامزد یا همه‌پرسی، دکمه‌ای با عنوان «مشاهده آراء» وجود دارد. با کلیک روی این دکمه، صفحه‌ای باز می‌شود که شامل یک خط فرمان است و از شما می‌خواهد «طیف رأی‌ها» را وارد کنید. در حال حاضر، این طیف به آدرس عمومی رأی‌دهنده اشاره دارد. با وارد کردن یک آدرس، می‌توانید شبکه غیرمتمرکز را برای آراء مرتبط با آن جستجو کنید، که راهی شفاف و ساده برای پیگیری فعالیت رأی‌گیری ارائه می‌دهد.\n\nنحوه استفاده از قابلیت «مشاهده آراء»\nبرای بررسی اینکه آیا دوست شما رأی داده است یا خیر، آدرس عمومی او را در خط فرمان وارد کنید. اپلیکیشن جستجویی در سطح شبکه آغاز می‌کند که ممکن است چند دقیقه طول بکشد، زیرا سیستم داده‌ها را جمع‌آوری و تأیید می‌کند. پس از تکمیل جستجو، نتایج در همان صفحه نمایش داده می‌شوند. اگر دوست شما هنوز رأی نداده باشد، نتیجه تعداد صفر رأی مرتبط با آدرس او را نشان می‌دهد.\n\nاگر دوست شما رأی داده باشد—چه به یک نامزد و چه در همه‌پرسی—می‌توانید ۵ تا ۲۰ دقیقه پس از ثبت رأی او این فرآیند را تکرار کنید. این زمان کوتاه انتظار، به رأی اجازه می‌دهد که تثبیت شود و در سراسر شبکه منتشر گردد. پس از این مرحله، سیستم رأی دوست شما را نمایش خواهد داد که به آدرس عمومی منحصربه‌فرد او متصل است. اگر رأی دوست شما پس از ۳۰ ساعت منقضی شود و این جستجو را تکرار کنید، دوباره تعداد صفر رأی نشان داده خواهد شد، زیرا آراء منقضی به‌طور خودکار از شمارش فعال حذف می‌شوند.\n\nآزمایش سیستم با آدرس خودتان\nهمچنین می‌توانید قابلیت «مشاهده آراء» را با استفاده از آدرس عمومی خودتان آزمایش کنید. این یک راه عالی برای تأیید شفافیت سیستم و اطمینان از انتشار صحیح رأی شما در سراسر شبکه غیرمتمرکز است. به خاطر داشته باشید که حتی رأی خودتان نیز در دستگاه شما ذخیره نمی‌شود؛ بلکه از طریق شبکه توزیع می‌شود. ۵ تا ۲۰ دقیقه پس از رأی‌دادن منتظر بمانید تا سیستم رأی شما را پردازش و منتشر کند، سپس جستجو را آغاز کنید.\n\nنکات کلیدی درباره «مشاهده آراء»\nقابلیت «مشاهده آراء» نه‌تنها اطمینان می‌دهد که فقط آراء فعال شمارش می‌شوند، بلکه با حذف خودکار آراء منقضی شفافیت کامل را نیز تقویت می‌کند. آراء‌ای که ظرف ۳۰ ساعت پس از ثبت تمدید نشوند، از نتایج حذف می‌شوند و دقت داده‌ها در زمان واقعی حفظ می‌گردد.\n\nعلاوه بر این، «طیف رأی‌ها» به آدرس‌های فردی محدود نیست. شما می‌توانید طیف را گسترش دهید تا گروه‌های گسترده‌تری از آراء را شامل شود، که به شما امکان می‌دهد نتایج را به‌طور مستقل تجزیه‌وتحلیل و شمارش کنید. این قابلیت، تعهد تنیده به شفافیت، مسئولیت‌پذیری و توانمندسازی کاربران را برای تأیید و تحلیل داده‌های انتخاباتی بر اساس شرایط خودشان برجسته می‌کند. برای اطلاعات بیشتر درباره شمارش آراء، به موضوع «تأیید و تحلیل نتایج» مراجعه کنید.",
    "Hp03_02": "تأیید و تحلیل نتایج",
    "Hp03_02_": "در تنیده، رأی‌ها توسط آدرس کاربران نمایندگی می‌شوند. هر آدرس به‌صورت منحصربه‌فرد از یک مجموعه ۶۰ کاراکتری ساخته شده است که شامل تمام اعداد و حروف انگلیسی می‌شود، به‌جز \"O\" (او بزرگ) و \"I\" (آی بزرگ) برای جلوگیری از ابهام. این ساختار منحصربه‌فرد آدرس‌ها تضمین می‌کند که هر رأی متمایز و قابل‌ردیابی باشد و پایه‌ای محکم برای شفافیت و صداقت فراهم می‌کند.\n\nدرک مفهوم \"طیف رأی‌ها\"\nمفهوم \"طیف رأی‌ها\" به کاربران امکان می‌دهد رأی‌ها را با استفاده از ترکیب‌های کاراکترهای آدرس‌ها دسته‌بندی و تحلیل کنند. به‌عنوان مثال، اگر رأی دوم یک کاندیدا ۱ میلیون رأی‌دهنده داشته باشد، می‌توانید مجموع را با تحلیل زیرمجموعه‌های آدرس‌ها بر اساس کاراکترهای ابتدایی‌شان بشکنید. با جمع‌آوری رأی‌هایی که با \"a\"، \"b\"، و ... شروع می‌شوند و ادامه این روند تا پوشش تمام ۶۰ کاراکتر، به مجموع ۱ میلیون رأی خواهید رسید.\n\nاین تقسیم‌بندی تنها محدود به کاراکتر اول نیست. می‌توانید جستجوی خود را با مشخص کردن کاراکترهای بیشتری مانند \"xa\" یا \"sD1\" دقیق‌تر کنید. برای مثال، اگر تمامی ترکیب‌هایی که با \"xa\" شروع می‌شوند (مانند \"xa\"، \"xb\"، ... \"x9\") را تحلیل و جمع‌آوری کنید، نتیجه با مجموعی که از جستجوی \"x\" به‌دست می‌آید برابر خواهد بود. هرچه ورودی دقیق‌تر باشد، نتایج محدودتر خواهند بود. برای ورودی‌های بسیار دقیق مانند یک آدرس کامل (مثلاً \"sD1eT…\")، سیستم می‌تواند وجود رأی مربوطه را تأیید کند و نتیجه‌ای معادل ۱ یا ۰ بازگرداند. این انعطاف‌پذیری کاربران را قادر می‌سازد الگوهای رأی‌گیری را در سطوح مختلف جزئیات تحلیل کنند.\n\nتحلیل دقیق رأی‌ها\nاگر تعداد رأی‌ها در یک طیف مشخص از یک آستانه (معمولاً کمتر از ۱,۰۰۰) کمتر باشد، تنیده نه‌تنها تعداد رأی‌ها را ارائه می‌دهد، بلکه لیست آدرس‌های فردی در آن طیف را نیز نمایش می‌دهد. این ویژگی شفافیتی بی‌نظیر را فراهم می‌کند و کاربران را قادر می‌سازد داده‌های رأی‌گیری را تا سطح آدرس‌های خاص بررسی کنند.\n\nبرای مثال، اگر \"sD1\" را وارد کنید و شبکه کمتر از ۱,۰۰۰ رأی در این طیف پیدا کند، تمامی آدرس‌های مربوطه به همراه جزئیات آماری نمایش داده خواهند شد. این امر اطمینان می‌دهد که هر رأی قابل‌ردیابی و تأیید است و اعتماد کاربران به صداقت سیستم تقویت می‌شود.\n\nموارد استفاده عملی برای شفافیت\n\"طیف رأی‌ها\" تنها محدود به تحلیل فردی نیست. کاربران می‌توانند جستجوی خود را برای پوشش محدوده‌های بزرگ‌تر گسترش دهند، که این امر امکان شمارش رأی‌ها برای یک رفراندوم یا کاندیدا را در میان گروه‌های بزرگ‌تر فراهم می‌کند. همان‌طور که در انتخابات مشروع امکان شمارش مجدد هر برگه رأی وجود دارد، طراحی تنیده اطمینان می‌دهد که کاربران می‌توانند هر رأی ثبت‌شده را بازشماری و تأیید کنند.\n\nاین ویژگی به‌طور عمیق در زیرساخت تنیده ادغام شده است و تضمین می‌کند که نتایج انتخابات نه‌تنها شفاف بلکه کاملاً قابل حسابرسی هستند. با ارائه ابزارهایی برای تحلیل جزئی و تأیید جامع، تنیده تعهد خود به پاسخگویی را تأیید می‌کند و کاربران را قادر می‌سازد با اطمینان کامل در فرآیند رأی‌گیری مشارکت کنند.",
    "Hp03_03": "پیام‌دهی به رأی‌دهندگان",
    "Hp03_03_": "اطمینان از واقعی بودن رأی‌دهندگان پشت هر رأی\nاکنون که رأی‌ها می‌توانند تحلیل و تأیید شوند، پرسش مهم بعدی این است که چگونه می‌توان اطمینان حاصل کرد که پشت هر رأی، یک رأی‌دهنده واقعی وجود دارد. در حالی که اقدامات پیشرفته ضد ربات تنیده که از رأی‌های جعلی جلوگیری می‌کنند در بخش پرسش‌های متداول پیشرفته توضیح داده شده است، این پلتفرم ابزارهایی نیز برای تأیید رأی‌دهندگان ارائه می‌دهد. یکی از این ابزارها امکان ارتباط با رأی‌دهندگان از طریق آدرس عمومی منحصربه‌فرد آنهاست.\n\nهمان‌طور که در موضوع تأیید و تحلیل نتایج توضیح داده شد، محدود کردن جستجو در طیف رأی‌ها به شما امکان می‌دهد آدرس رأی‌دهندگان را نیز شناسایی کنید. با کپی کردن آدرس و قرار دادن آن در صفحه پیام‌ها (اطلاعات بیشتر در بخش پیام‌ها و تماس‌ها)، می‌توانید مستقیماً به رأی‌دهنده پیام دهید و نظر او را جویا شوید.\n\nراهنمای ارسال پیام به صورت مسئولانه\nهنگام پیام دادن به رأی‌دهندگان، رعایت حریم خصوصی و پایبندی به قوانین اجتماعی تنیده بسیار مهم است. هرگز اطلاعات شخصی مانند نام، جزئیات تماس، یا هر چیزی که می‌تواند هویت رأی‌دهنده را فاش کند، درخواست یا به اشتراک نگذارید. اگرچه تنیده اطمینان می‌دهد که هویت و آدرس IP شما ناشناس باقی می‌ماند، اشتراک‌گذاری اطلاعات شخصی نقض قوانین پلتفرم است و ممکن است امنیت کاربران را به خطر بیندازد.\n\nبه‌عنوان یک کاربر مسئول، از درخواست اطلاعات شخصی دیگران تحت هر بهانه‌ای، مانند جمع‌آوری آمار، خودداری کنید. همچنین اگر کسی اطلاعات شخصی شما را درخواست کرد، او را به‌عنوان یک کاربر متخلف در نظر بگیرید که ممکن است قصد تضعیف امنیت و یکپارچگی برنامه را داشته باشد. چنین آدرس‌هایی را فوراً بلاک کنید (اطلاعات بیشتر در بخش پیام‌ها و تماس‌ها).\n\nایجاد اعتماد و شفافیت از طریق پیام‌رسانی\nامکان پیام دادن به رأی‌دهندگان ابزاری قدرتمند برای تقویت شفافیت و اعتماد در انتخابات است. با ارتباط مستقیم با رأی‌دهندگان، کاربران می‌توانند اصالت رأی‌ها را به‌طور مستقل تأیید کنند، دیدگاه‌های خود را به اشتراک بگذارند و گفتگوهای سازنده‌ای را ترویج دهند. این ویژگی تضمین می‌کند که هر رأی به یک فرد واقعی متصل است، درحالی‌که حریم خصوصی و امنیت همه کاربران حفظ می‌شود.\n\nمهم است که با حس مسئولیت و احترام به این ویژگی نزدیک شوید. هدف تنیده ایجاد پلتفرمی است که کاربران در آن احساس قدرت کنند تا نتایج انتخابات را بدون نقض حریم خصوصی دیگران تأیید کنند. پیام دادن به رأی‌دهندگان باید به‌عنوان فرصتی برای افزایش شفافیت در نظر گرفته شود، نه وسیله‌ای برای درخواست جزئیات شخصی یا ایجاد ناراحتی.",
    "Ht04": "Ht04",
    "Hp04_01": "معرفی",
    "Hp04_01_": "در هر جامعه‌ای که با خرد جمعی و اراده‌ی مشترک اداره می‌شود، تصمیمات در سطح ملی بازتاب‌دهنده‌ی نیازها و آرزوهای مردم است. سیستم‌هایی مانند درخواست عمومی در بریتانیا—که با ۱۰۰,۰۰۰ امضا منجر به بحث در پارلمان می‌شود—یا ایالات متحده، که در آن احزاب سوم و کاندیداهای مستقل می‌توانند پس از جمع‌آوری تعداد مشخصی امضای معتبر وارد برگه‌های رأی شوند، نمونه‌هایی از نقش مشارکت مردمی در شکل‌دهی به حکمرانی هستند. در تنیده، درخواست‌های عمومی که برای آن‌ها امضا جمع‌آوری می‌شود، «خواست‌برگ» نامیده می‌شوند.\n\nتنیده نیز با پیروی از چنین اصول دموکراتیکی، به کاربران این امکان را می‌دهد که از طریق فرآیند خواست‌برگ غیرمتمرکز، کاندیداهای جدید یا همه‌پرسی‌ها را پیشنهاد کنند. اگر به یک موضوع باور دارید، می‌خواهید کاندیدایی را معرفی کنید یا همه‌پرسی‌ای را آغاز نمایید، می‌توانید خواست‌برگ خود را مستقیماً در داخل اپلیکیشن ایجاد کنید. با جمع‌آوری تعداد امضاهای موردنیاز در بازه‌ی زمانی مشخص، پیشنهاد شما در شبکه‌ی تنیده ادغام شده و کل جامعه می‌تواند در آن مشارکت کند.\n\nاین فرآیند کاملاً غیرمتمرکز است. خواست‌برگ روی دستگاه شما ایجاد می‌شود و زمانی که آستانه‌ی امضاهای معتبر را پشت سر گذاشت، دستگاه شما خواست‌برگ را منتشر می‌کند. این خواست‌برگ سپس توسط دستگاه‌های سایر کاربران به صورت خودکار بررسی و در صورت تأیید، به شبکه ادغام می‌شود و تا تاریخ انقضا معتبر باقی می‌ماند.\n\nپس از تاریخ انقضا، دیگر نمی‌توان رأی جدیدی به کاندیدا یا همه‌پرسی داد و آرایی که مدت زمان اعتبار آن‌ها فراتر از تاریخ انقضا است، منقضی نخواهند شد. تغییرات آماری در این دوره ممکن است به دلیل تکمیل فرآیند انتشار آرایی باشد که قبلاً به طور کامل توزیع نشده بودند.\n\nبرای سه روز پس از انقضا، نتایج همچنان برای تمام کاربرانی که کاندیدا یا همه‌پرسی را قبل از تاریخ انقضا به شبکه‌ی خود اضافه کرده بودند قابل مشاهده خواهد بود. پس از این دوره، کاندیدا یا همه‌پرسی به طور کامل از شبکه حذف می‌شود. این رویکرد توازن میان شفافیت، عدالت و فرصت برابر را تضمین می‌کند تا همه‌ی کاربران بتوانند در شکل‌دهی به مسائل مهم مشارکت داشته باشند.",
    "Hp04_02": "چگونگی ایجاد خواست‌برگ",
    "Hp04_02_": "مرحله ۱: ایجاد خواست‌برگ شما\n\nبرای ایجاد یک خواست‌برگ، به صفحه \"برگزیده\" یا \"همه‌پرسی\" بروید. بر روی علامت \"+\" در گوشه پایین سمت راست صفحه کلیک کنید تا به صفحه ایجاد خواست‌برگ هدایت شوید.\n\nدر اینجا می‌توانید خواست‌برگ جدیدی برای یک کاندیدا یا همه‌پرسی ایجاد کنید. تمامی فیلدهای مورد نیاز را به زبان فارسی پر کرده و تصویری برای خواست‌برگ خود بارگذاری کنید. برای حفظ کارایی شبکه، اندازه تصاویر به 50 کیلوبایت محدود است.\n\nمرحله ۲: جمع‌آوری امضاءها\n\nپس از ایجاد خواست‌برگ، این خواست‌برگ تنها بر روی دستگاه شما قابل مشاهده خواهد بود. شما شناسه منحصربه‌فرد و کد تصویری (QR) آن را مشاهده خواهید کرد که می‌توانید آن را با دیگران به اشتراک بگذارید تا امضاءها را جمع‌آوری کنید.\n\nبرای تبدیل موفقیت‌آمیز خواست‌برگ، در طی ۷ روز به 100,000 امضاء برای همه‌پرسی یا 50,000 امضاء برای کاندیدا نیاز دارید. اگر تا تاریخ مقرر به این حد نصاب نرسیدید، خواست‌برگ به طور خودکار از دستگاه شما حذف خواهد شد.\n\nدر هنگام جمع‌آوری امضاءها، مطمئن شوید که دستگاه شما آنلاین باشد تا امضاءها از سایر کاربران دریافت شود. اگر دستگاه شما آفلاین باشد، امضاءها موفق دریافت نخواهد شد. به دلیل ماهیت غیرمتمرکز تنیده و تعداد بالای امضاءهای مورد نیاز، ممکن است جمع‌آوری تمام امضاءها در زمان کوتاه توسط یک دستگاه غیرممکن باشد.\n\nبرای غلبه بر این مشکل، می‌توانید شناسه خواست‌برگ خود را مخفی نگه دارید و آن را با دوستان معتمد خود (۲۰ تا ۴۰ نفر که به عنوان \"لایه اول\" شناخته می‌شوند) به اشتراک بگذارید تا آن‌ها به نمایندگی از شما امضاء جمع‌آوری کنند. این امضاءها از طریق دستگاه‌های آن‌ها منتقل شده و به شما ارسال خواهد شد.\n\nمرحله ۳: توزیع و تجمیع امضاءها\n\nپس از اینکه لایه اول از کاربران خواست‌برگ شما را امضاء کردند، همان خواست‌برگ بر روی دستگاه‌های آن‌ها منتقل خواهد شد، اما با شناسه منحصربه‌فرد خودشان. زمانی که این شناسه را هر کدام در اجتماع خود به اشتراک بگذارند، \"لایه دوم\" از کاربران به امضاء کردن خواست‌برگ خواهند پرداخت. تمام اتصالات جدید از طریق دستگاه‌های آن‌ها صورت خواهد گرفت و امضاءهای جمع‌آوری شده در این لایه بر روی دستگاه‌های آن‌ها تجمیع می‌شود.\n\nاین فرآیند بار را در میان دستگاه‌های مختلف توزیع می‌کند و باعث می‌شود جمع‌آوری امضاءها به طور مؤثرتری انجام شود. هر لایه جدید می‌تواند امضاءهای خود را جمع‌آوری کند، و بدین ترتیب اثر آبشاری ایجاد می‌شود. پس از جمع‌آوری امضاءها، هر لایه می‌تواند امضاءهای جمع‌آوری شده خود را به لایه قبلی خود بازگرداند. در نهایت، لایه اول می‌تواند این امضاءها به صورت دسته‌ای به دستگاه شما ارسال کند، با حداقل فاصله زمانی دو ساعت بین هر دسته.\n\nبه‌یاد داشته باشید که فقط یک امضاء از هر کاربر پذیرفته خواهد شد. تمام امضاءها باید بر روی دستگاه اصلی که خواست‌برگ ایجاد شده است تجمیع شود. پس از جمع‌آوری امضاءهای مورد نیاز، خواست‌برگ شما به شبکه تنیده اضافه خواهد شد و شما فقط باید برای چند ساعت آنلاین باشید تا کاندیدا یا همه‌پرسی جدید در دسترس کل شبکه قرار گیرد.",
    "Hp04_03": "چگونگی امضای خواست‌برگ",
    "Hp04_03_": "مرحله ۱: بررسی شرایط درخواست‌برگ\n\nقبل از امضای هر خواست‌برگ، لطفاً اطمینان حاصل کنید که حداقل ۷ روز از اولین پایداری موفق شما در شبکه یا آخرین امضای شما از خواست‌برگ گذشته باشد. این قانون برای اطمینان از این‌که امضاها از افراد واقعی است و سیستم دور زده نمی‌شود، وضع شده است.\n\nمرحله ۲: یافتن خواست‌برگ\n\nبرای امضای یک خواست‌برگ، ابتدا باید بدانید که خواست‌برگ مربوط به چه موضوعی است: آیا برای یک کاندیدای جدید است یا یک همه‌پرسی جدید؟\n\nبرای کاندیدای جدید، به قسمت \"برگزیده\" بروید.\nبرای همه‌پرسی، به قسمت \"همه‌پرسی\" بروید.\nدر هر دو قسمت، علامت \"+\" در پایین سمت راست صفحه را بزنید تا به صفحه خواست‌برگ بروید.\n\nمرحله ۳: امضای خواست‌برگ\n\nدر صفحه خواست‌برگ، به طور پیش‌فرض شما در حالت \"ایجاد\" هستید. برای تغییر به حالت \"امضا\"، روی \"امضا\" در بالای سمت چپ صفحه بزنید.\nحالا شما می‌توانید خواست‌برگ را به دو روش امضا کنید:\n\nوارد کردن شناسه خواست‌برگ: شناسه خواست‌برگ را کپی کرده و در فیلد متنی قرار دهید. پس از اینکه از فیلد خارج شدید، شناسه پردازش می‌شود.\nاسکن کد تصویری (QR): از اسکنر داخلی برای خواندن کد تصویری خواست‌برگ استفاده کنید.\nاگر شناسه معتبر باشد، جزئیات خواست‌برگ روی صفحه شما نمایش داده می‌شود. جزئیات را بررسی کنید و اگر از آن پشتیبانی می‌کنید، روی \"ثبت\" بزنید تا امضای شما ارسال شود.\n\nمرحله ۴: منتظر پردازش امضا باشید\n\nسپس دستگاه شما تلاش می‌کند تا امضای شما را به صاحب خواست‌برگ ارسال کند. این فرایند ممکن است چند دقیقه طول بکشد. اگر هم شما و هم سازنده خواست‌برگ آنلاین و در شبکه پایدار باشید، امضا با موفقیت دریافت خواهد شد.\nنتیجه امضای شما را می‌توانید در صفحه \"خانه\" مشاهده کنید. پس از موفقیت، خواست‌برگ در تب‌های \"همه‌پرسی\" یا \"برگزیده\" بسته به نوع آن ظاهر می‌شود اما بدون عکس خواهد بود.\n\nمرحله ۵: درک قفل ۷ روزه\n\nپس از امضای یک خواست‌برگ، شما قادر به امضای هیچ خواست‌برگ جدیدی در ۷ روز آینده نخواهید بود. این یک محدودیت مهم است تا از امضای چندگانه از سوی یک فرد در یک بازه زمانی کوتاه جلوگیری شود.\n\nمرحله ۶: کمک به هدف\n\nبا باز کردن صفحه خواست‌برگ جدید، متوجه خواهید شد که شناسه شما با شناسه‌ای که قبلاً امضا کرده‌اید متفاوت است. اگر به هدف آن کاندیدا یا همه‌پرسی اعتقاد دارید، شناسه خود را با دوستان خودتان به اشتراک بگذارید و به نمایندگی از خواست‌برگ اصلی امضا جمع کنید. با این کار، حالا می‌توانید تعداد امضاهای اضافه شده را در خواست‌برگ خود مشاهده کنید. سپس باید امضاهای جمع‌آوری‌شده خود را با زدن دکمه \"ارسال امضاهای جدید\" ارسال کنید. امضاها به صورت دسته‌ای به شناسه اصلی ارسال می‌شوند، اگر آنلاین باشد. سیستم به طور هوشمند هر بار امضاهای جدید را از امضاهای قبلی تشخیص می‌دهد و فقط امضاهای جدید را دسته‌ای به شناسه اصلی ارسال می‌کند. فاصله بین هر دو دسته باید حداقل دو ساعت باشد تا از هرگونه ترافیک داده جلوگیری شود.\nبه یاد داشته باشید که هدف شما از جمع‌آوری امضا به نمایندگی از شناسه اصلی، علاوه بر کمک به هدف، کمک به تقسیم جریان ترافیک به سمت دستگاه شما است. بنابراین، فاصله زمانی مناسب برای ارسال امضاها را انتخاب کنید و اطمینان حاصل کنید که تمام امضاها را تا تقریبا یک روز قبل از انقضای خواست‌برگ به شناسه اصلی ارسال کرده‌اید.",
    "Ht05": "Ht05",
    "Hp05_01": "مقدمه پیام‌رسانی",
    "Hp05_01_": "چرا تنیده قابلیت پیام‌رسانی دارد؟\n\nتنیده یک پیام‌رسان سنتی نیست. در عوض، سیستم پیام‌رسانی آن دو هدف کلیدی را دنبال می‌کند:\n\n شفافیت – به کاربران امکان می‌دهد که درباره نظرسنجی‌ها و خواست‌برگ‌ها درون برنامه به‌صورت ایمن گفتگو کنند.\n حریم خصوصی فوق‌العاده – یک روش ارتباطی امن و غیرمتمرکز برای کاربرانی که امنیت را بر راحتی ترجیح می‌دهند.\n\nنحوه عملکرد پیام‌رسانی در تنیده\n\n تنیده سرور مرکزی ندارد. این یعنی پیام‌ها در هیچ جایی ذخیره نمی‌شوند و فقط در صورتی ارسال و دریافت می‌شوند که فرستنده و گیرنده هر دو آنلاین و در شبکه پایدار باشند.\n اگر گیرنده آفلاین باشد، پیام شما تحویل داده نمی‌شود و هیچ راهی برای دریافت آن در آینده وجود ندارد.\n با این حال، اگر در شبکه پایدار بمانید، حدود ۲۵ دقیقه برنامه شما به‌طور متناوب تلاش خواهد کرد تا مخاطب شما را در شبکه پیدا کند و پیام را به او برساند.\n\nچه چیزی پیام‌رسانی در تنیده را متفاوت می‌کند؟\n\n بدون وابستگی به شماره تلفن – برخلاف پیام‌رسان‌های دیگر، در تنیده شماره تلفن نقشی ندارد. شما تنها در صورتی می‌توانید با فردی تماس بگیرید که آدرس تنیده او را داشته باشید.\n پیام‌ها مستقیماً ارسال نمی‌شوند – یک پیام ممکن است از بین ۸ تا ۱۰ کاربر دیگر عبور کند تا به مقصد برسد. این ویژگی به مخفی ماندن موقعیت فرستنده و افزایش حریم خصوصی کمک می‌کند.\n فقط پیام‌های متنی – به دلیل مسیریابی غیرمتمرکز، ارسال تصاویر و ویدئوها مجاز نیست تا کارایی شبکه حفظ شود.\n\nامنیت و رمزگذاری\n\n رمزگذاری سرتاسری – همه پیام‌ها رمزگذاری می‌شوند و فقط فرستنده و گیرنده قادر به خواندن آن‌ها هستند. هیچ فرد دیگری، حتی کاربرانی که پیام از مسیر آن‌ها عبور می‌کند، به محتوای آن دسترسی ندارند.\n عدم بازیابی داده‌ها – پیام‌ها فقط در گوشی شما و گوشی گیرنده ذخیره می‌شوند. اگر برنامه یا یک مکالمه را حذف کنید، هیچ راهی برای بازیابی آن وجود ندارد.\n حذف پیام فقط از دستگاه شما – اگر یک پیام را پاک کنید، فقط از گوشی شما حذف می‌شود، اما در گوشی گیرنده باقی می‌ماند تا زمانی که خود او آن را حذف کند.",
    "Hp05_02": "نحوه ارسال پیام",
    "Hp05_02_": "پیام‌ها فقط زمانی ارسال و دریافت می‌شوند که هر دو کاربر آنلاین و پایدار در شبکه باشند. برای ارسال پیام مراحل زیر را دنبال کنید:\n\n۱. دسترسی به صفحه پیام‌ها\nاز صفحه خانه روی پیام‌ها ضربه بزنید تا تاریخچه پیام‌های خود را ببینید.\nبرای شروع یک مکالمه جدید، روی آیکون پیام در گوشه پایین سمت راست ضربه بزنید.\n\n۲. وارد کردن آدرس گیرنده\nاز شما خواسته می‌شود آدرس تنیده گیرنده (یک شناسه منحصربه‌فرد ۷۷ کاراکتری) را وارد کنید.\nمی‌توانید آدرس را به‌صورت دستی وارد کنید، کپی-پیست کنید، یا کد QR آن را اسکن کنید.\nپس از وارد کردن آدرس، می‌توانید پیام خود را تایپ و ارسال کنید—فقط شامل متن و ایموجی‌های استاندارد موجود در صفحه‌کلیدتان—اما تنها در صورتی که در شبکه پایدار باشید.\n\n۳. وضعیت تحویل پیام و زمان‌بندی\nپس از ارسال پیام، یک دایره قرمز رنگ تایمر در کنار آن ظاهر می‌شود که نشان می‌دهد برنامه شما در حال تلاش برای ارسال پیام است.\nتلاش برای تحویل پیام تا حدود ۲۵ دقیقه ادامه دارد. اگر گیرنده در این مدت در شبکه پایدار شود، پیام تحویل داده خواهد شد.\nاگر پیام با موفقیت تحویل داده شود، دایره قرمز به دو تیک (✔✔) تغییر می‌کند که نشان می‌دهد پیام به صندوق ورودی گیرنده رسیده است. با این حال، این به معنای خوانده شدن پیام نیست.\nاگر پس از ۲۵ دقیقه پیام تحویل داده نشود، دایره قرمز به علامت تعجب قرمز (❗) تبدیل می‌شود که نشان می‌دهد دیگر هیچ تلاشی برای ارسال پیام انجام نخواهد شد.\n\n۴. ارسال پیام به‌صورت بهینه\nابتدا یک پیام ارسال کنید و منتظر تأیید تحویل باشید، سپس پیام‌های بعدی را ارسال کنید. این کار اطمینان می‌دهد که گیرنده آنلاین است و از ارسال ناموفق جلوگیری می‌کند.\nاگر قبل از به‌روزرسانی وضعیت پیام از برنامه خارج شوید، دایره قرمز تایمر همیشه باقی می‌ماند. این بدان معناست که ممکن است پیام شما تحویل داده شده باشد، اما چون قبل از دریافت تأیید از شبکه خارج شدید، از وضعیت نهایی آن مطلع نخواهید شد.\n\n۵. بلاک کردن مخاطبین ناخواسته\nاگر یک کاربر را بلاک کنید، دیگر نمی‌تواند شما را در شبکه پیدا کند و هیچ‌یک از پیام‌های او به شما نخواهد رسید.\nمی‌توانید لیست مخاطبین بلاک شده خود را در بخش تنظیمات مدیریت کنید و در صورت نیاز، کاربران را از حالت بلاک خارج کنید.",
    "Hp05_03": "مدیریت تماس‌ها",
    "Hp05_03_": "برای مدیریت تماس‌های بین خود در تنیده، ابتدا از صفحه خانه به صفحه تماس‌ها بروید. در این صفحه، فهرستی از تمام تماس‌های شما نمایش داده می‌شود. در پایین سمت راست، آیکون شخص با علامت جمع (+) را خواهید دید. روی آن ضربه بزنید تا یک مخاطب جدید اضافه کنید.\n\nبرای اضافه کردن مخاطب جدید، باید نام و آدرس او را وارد کنید. می‌توانید آدرس ۷۷ کاراکتری را به صورت دستی تایپ یا کپی کنید و یا کد تصویری (QR) آن را اسکن نمایید. پس از اضافه کردن، مخاطب جدید در فهرست تماس‌های شما نمایش داده خواهد شد.\nآدرس شما به طور خودکار به عنوان اولین تماس‌ه در سیستم اضافه می‌شود.\n\nمشاهده و مدیریت مخاطبین\n\nبا ضربه زدن بر روی هر تماس در فهرست خود، می‌توانید آدرس او را مشاهده کرده و کد تصویری آن را با دیگران به اشتراک بگذارید. اگر می‌خواهید مستقیماً برای او پیام ارسال کنید، تنها کافیست روی آیکون پیام ضربه بزنید.\n\nبرای حذف یک مخاطب، روی آیکون سه نقطه در بالای سمت راست صفحه جزئیات تماس ضربه بزنید. این کار منوی گزینه‌ها را باز می‌کند، جایی که می‌توانید انتخاب کنید که مخاطب را از فهرست خود حذف کنید.",
    "Ht06": "Ht06",
    "Hp06_01": "پایداری و مشارکت در شبکه",
    "Hp06_01_": "پایداری در شبکه چیست؟\n\nبه‌محض باز کردن تنیده، یک شمارش معکوس در صفحه خانه ظاهر می‌شود. این شمارش معکوس نشان‌دهنده تلاش اپلیکیشن برای تثبیت در شبکه است. در طول این مدت، اپلیکیشن سعی می‌کند تا اتصالات ضروری را برقرار کند و پروتکل‌های موردنیاز را فعال سازد. برای پایدار شدن در شبکه، ساعت گوشی شما باید حداقل تقریباً به‌روز باشد. تثبیت در شبکه اولین و حیاتی‌ترین گام برای انجام هرگونه فعالیت در تنیده است.\n\nاگر تثبیت موفقیت‌آمیز باشد، شما می‌توانید از تمام قابلیت‌های شبکه استفاده کنید. اما اگر به هر دلیلی این فرآیند ناموفق باشد، پس از پایان شمارش معکوس، دکمه تازه‌سازی (رفرش) به‌جای آن نمایش داده می‌شود. با فشردن این دکمه، اپلیکیشن دوباره تلاش می‌کند تا در شبکه تثبیت شود.\n\nچرا مشارکت در شبکه مهم است؟\n\nتنیده یک اپلیکیشن مبتنی بر مشارکت جامعه است. هرچه تعداد کاربران فعال در شبکه بیشتر باشد، جریان اطلاعات قوی‌تر و ارتباطات پایدارتر خواهد بود. حتی پس از ثبت رأی، می‌توانید اپلیکیشن را در پس‌زمینه باز نگه دارید تا با حفظ اتصال به اینترنت، به پایداری شبکه کمک کنید.\n\nدر شرایطی که شبکه تحت حمله یا محدودیت ارتباطی باشد، مشارکت کاربران اهمیت بیشتری پیدا می‌کند. حضور مداوم کاربران در شبکه باعث می‌شود که اطلاعات به‌درستی در میان آن‌ها توزیع شود.\n\nمیزان مصرف اینترنت و باتری چقدر است؟\n\nنگه داشتن تنیده در پس‌زمینه تأثیر چندانی بر مصرف باتری ندارد. مصرف داده روزانه آن حدود ۳۵ مگابایت است (کمتر از یک بررسی مختصر اینستاگرام)، بنابراین می‌توانید بدون نگرانی، اپلیکیشن را در پس‌زمینه فعال نگه دارید.\n\nبرای جلوگیری از مصرف بی‌رویه اینترنت، اپلیکیشن به‌طور خودکار تلاش‌های مکرر برای پایداری مجدد را انجام نمی‌دهد. اگر به دلیل قطع اینترنت یا هر مشکل دیگری از شبکه خارج شوید، دکمه تازه‌سازی (رفرش) در صفحه خانه ظاهر می‌شود. پیشنهاد می‌شود هر از گاهی اپلیکیشن را بررسی کنید و در صورت مشاهده این دکمه، آن را فشار دهید تا دوباره در شبکه پایدار شوید.\n\nتنیده به‌گونه‌ای طراحی شده که در عین مصرف حداقلی از منابع کاربران، به مشارکت مداوم آن‌ها نیز وابسته است. این تعادل، هم به نفع کاربران و هم به نفع پایداری شبکه است.",
    "Hp06_02": "رمزنگاری در تنیده (مبحث پیشرفته)",
    "Hp06_02_": "قدرت آدرس‌های تنیده\n\nهر کاربر در تنیده با یک آدرس تنیده شناخته می‌شود که از کلید عمومی EdDSA (الگوریتم امضای دیجیتال بیضوی) با استفاده از منحنی ed448 مشتق شده است. این انتخاب سطح امنیتی ۲۲۴ بیتی را فراهم می‌کند، که بسیار قوی‌تر از سطح امنیتی ۱۲۸ بیتی در بسیاری از امضاهای دیجیتال رایج است.\n\nچرا Ed448 انتخاب شده است؟\nمقاومت در برابر محاسبات کوانتومی – در میان منحنی‌های رمزنگاری کلاسیک، Ed448 یکی از آخرین گزینه‌هایی خواهد بود که توسط رایانه‌های کوانتومی شکسته می‌شود، زیرا برای حمله به آن نیاز به قدرت پردازشی بسیار بالایی است.\n\nاستقلال از تأثیرگذاری NSA – برخلاف برخی استانداردهای رمزنگاری پرکاربرد مانند ECDSA که توسط NSA معرفی شده‌اند، Ed448 مستقل از این نهاد توسعه یافته است، و این نگرانی را که ممکن است در استانداردهای مرتبط با دولت‌های خاص، درهای پشتی (Backdoor) وجود داشته باشد، برطرف می‌کند.\n\nبه همین دلیل، آدرس‌های تنیده آینده‌نگر، ایمن و مستقل از نفوذ سازمان‌های دولتی هستند.\n\nرمزگذاری سرتاسری و فرآیند احراز هویت در تنیده\n\nتنیده اطمینان حاصل می‌کند که تمام ارتباطات از فرستنده تا گیرنده به‌طور کامل رمزگذاری شده‌اند. این امنیت از طریق یک فرآیند دو مرحله‌ای برای برقراری ارتباط امن برقرار می‌شود.\n\nمرحله ۱: تبادل کلید با ECDH (الگوریتم دیفی-هلمن منحنی بیضوی)\n\nهر ارتباط در تنیده با تبادل کلید بر اساس ECDH و منحنی X448 آغاز می‌شود. این منحنی به دلایل زیر انتخاب شده است:\n\nسرعت بالا – عملکرد آن نسبت به بسیاری از گزینه‌های دیگر سریع‌تر است.\nامنیت بالا – سطح امنیت ۲۲۴ بیتی آن از اکثر گزینه‌های دیگر فراتر می‌رود و حفاظت برتری را تضمین می‌کند.\n\nدر این مرحله، دو طرف یک کلید مشترک تولید می‌کنند که بعداً برای رمزگذاری پیام‌ها مورد استفاده قرار می‌گیرد. اما یک سوال امنیتی مهم وجود دارد:\n\nچگونه می‌توان مطمئن شد که یک مهاجم (مانند حمله مرد میانی) در حال رهگیری این کلیدها نیست؟\n\nمرحله ۲: احراز هویت با امضای دیجیتال EdDSA\n\nبرای جلوگیری از حملات مرد میانی (Man-in-the-Middle)، آدرس تنیده نقش کلیدی در تأیید اعتبار فرآیند تبادل کلید دارد.\n\nهر بخش از فرآیند تبادل کلید ابتدا هش شده و سپس با کلید خصوصی EdDSA کاربر امضا می‌شود.\nطرف گیرنده امضا را با آدرس تنیده فرستنده مطابقت می‌دهد تا هویت او را تأیید کند.\n\nبرای اطمینان از قدرت رمزنگاری، تنیده از الگوریتم‌های هش ضعیف مانند SHA-1 استفاده نمی‌کند. در عوض، SHA-512 به عنوان تابع هش اصلی مورد استفاده قرار می‌گیرد و در برخی موارد برای بهینه‌سازی عملکرد از SHA-256 استفاده می‌شود.\n\nرمزگذاری پیام‌های ارسالی\n\nپس از اتمام مرحله احراز هویت، کلید مشترک ECDH به یک کلید متقارن ۲۵۶ بیتی در AES-GCM تبدیل می‌شود.\n\nAES-256 GCM انتخاب شده است، زیرا این الگوریتم به‌عنوان یکی از امن‌ترین روش‌های رمزگذاری در دنیای مدرن شناخته می‌شود و استاندارد رمزگذاری TLS نیز بر پایه آن است.\nاین کلید هرگز از طریق شبکه ارسال نمی‌شود، که تضمین می‌کند فقط دو طرف ارتباط به آن دسترسی دارند.\n\nاین به این معنی است که، هر پیام، هر رأی، و هر تعامل در تنیده کاملاً خصوصی باقی می‌ماند و در برابر استراق سمع و نفوذ محافظت می‌شود.",
    "Hp06_03": "رله‌های لایه‌ای در تنیده (مبحث پیشرفته)",
    "Hp06_03_": "نحوه عملکرد مسیریابی پیازی سنتی\n\nدر شبکه‌های مسیریابی پیازی مانند Tor، اتصال کاربر از طریق سه گره رمزگذاری‌شده قبل از رسیدن به مقصد هدایت می‌شود:\n\nرله نگهبان (Guard Relay) فقط آدرس IP کاربر را می‌داند اما از مقصد نهایی بی‌خبر است.\nرله‌های میانی (Middle Relays) داده‌های رمزگذاری‌شده را عبور می‌دهند، به طوری که نگهبان از مقصد مطلع نمی‌شود.\nرله خروجی (Exit Relay) فقط مقصد نهایی را می‌داند اما از کاربر اصلی اطلاعی ندارد.\n\nاین ساختار تضمین می‌کند که هیچ گره‌ای به طور کامل قادر به شناسایی فرستنده و گیرنده نیست و در نتیجه، هویت کاربر محفوظ می‌ماند.\n\nچرا تنیده به رویکردی پیشرفته‌تر نیاز دارد؟\n\nتنیده متفاوت از شبکه‌های پیازی سنتی است، زیرا:\n\nدر تنیده هیچ سرور مرکزی ثابتی وجود ندارد – کاربران مستقیماً با یکدیگر ارتباط برقرار می‌کنند، نه فقط با وب‌سایت‌ها.\nهم فرستنده و هم گیرنده باید ناشناس بمانند، برخلاف Tor که مقصد (وب‌سایت) برای رله خروجی مشخص است.\n\nبرای حل این چالش، تنیده مسیریابی پیازی را گسترش داده و آن را به یک سیستم کاملاً متقارن رله‌های لایه‌ای تبدیل کرده است.\n\nنحوه عملکرد رله‌های لایه‌ای در تنیده\n\nدر شبکه تنیده، هر کاربر توسط یک رله خروجی نمایندگی می‌شود، که تنها گره‌ای است که آدرس تنیده او را می‌داند. از سوی دیگر، رله نگهبان تنها گره‌ای است که آدرس IP او را می‌داند.\n\nبین این دو، ۲ تا ۳ رله میانی قرار دارند که تضمین می‌کنند:\n\nهیچ رله‌ای به طور همزمان هم هویت کاربر و هم مقصد ارتباطی او را نمی‌داند.\nحتی اگر یک رله به خطر بیفتد، نمی‌تواند مسیر کامل ارتباط را فاش کند.\n\nبنابراین، هنگامی که دو کاربر با یکدیگر ارتباط برقرار می‌کنند، پیام آن‌ها از طریق ۸ تا ۱۰ رله عبور می‌کند (با احتساب رله‌های میانی هر دو کاربر)، که ناشناس‌سازی کامل را تضمین می‌کند.\n\nچرا تنیده فقط از پیام‌های متنی پشتیبانی می‌کند؟\n\nبا شبکه‌ای متشکل از ۱۰ تا ۱۲ رله در هر پیام، مدیریت داده‌ها به‌صورت کارآمد بسیار مهم است. به همین دلیل تنیده فقط از ارتباط متنی پشتیبانی می‌کند:\n\nارسال فایل‌های حجیم مانند تصاویر و ویدئوها، سرعت شبکه را کاهش می‌دهد و خطر تحلیل الگوهای ترافیکی را افزایش می‌دهد.\nپیام‌های متنی تضمین می‌کنند که ارتباطات سریع، کارآمد و کاملاً خصوصی باقی بمانند.",
    "Hp06_04": "پروتکل‌های ضد ربات (موضوع پیشرفته)",
    "Hp06_04_": "حفظ محیطی عاری از ربات‌ها برای یکپارچگی شبکه‌ی تنیده ضروری است. برخلاف شبکه‌های سنتی که در آن‌ها نهادهای مرکزی اقدامات تأیید هویت را اعمال می‌کنند، تنیده از رویکردی مبتنی بر مشارکت جامعه و پروتکل‌های پویا برای حذف ربات‌ها و جلوگیری از سوءاستفاده از سیستم استفاده می‌کند.\n\nاعتبارسنجی مبتنی بر جامعه\nاولین لایه‌ی محافظت در برابر ربات‌ها در تنیده، مکانیزم اعتبارسنجی جامعه‌محور است. هر آدرس و رأی مربوطه‌ی آن از طریق اعتبارسنجی جمعی توسط شرکت‌کنندگان شبکه بررسی می‌شود. این روند باعث می‌شود که تنها کاربران واقعی بتوانند در رأی‌گیری‌ها تأثیر بگذارند، و در نتیجه، دستکاری خودکار نتایج غیرممکن می‌شود.\n\nاگرچه این روش از ورود رأی‌های تقلبی جلوگیری می‌کند، اما یک چالش دیگر باقی می‌ماند: چگونه می‌توان از هجوم آدرس‌های جعلی به شبکه جلوگیری کرد؟\n\nپروتکل‌های اختصاصی به‌عنوان دفاع در برابر حملات خودکار\nبرخلاف شبکه‌های متداول که از پروتکل‌های شناخته‌شده‌ای مانند HTTP یا WebSocket استفاده می‌کنند، تنیده بر پایه‌ی پروتکل‌های اختصاصی خود عمل می‌کند. این پروتکل‌ها به‌طور عمومی مستند نشده‌اند و به‌گونه‌ای طراحی شده‌اند که مهندسی معکوس آن‌ها بسیار دشوار باشد.\n\nیک مهاجم برای نفوذ به شبکه باید چندین لایه از پروتکل‌های متغیر را پشت سر بگذارد—هر پروتکل دارای پارامترهای پویا و در حال تغییر است. این لایه‌ها شامل موارد زیر می‌شوند:\n\nپروتکل‌های ایجاد ارتباط – نحوه‌ی برقراری ارتباط امن بین نودها را تعیین می‌کنند.\nپروتکل‌های کشف آدرس‌ها – راهکاری برای یافتن کاربران بدون افشای اطلاعات هویتی.\nپروتکل‌های انتشار رأی – تضمین می‌کنند که رأی‌ها به‌صورت ایمن توزیع شوند و دستکاری نشوند.\nهر پروتکل بر موفقیت اجرای پروتکل قبلی متکی است و یک مدل امنیتی چندمرحله‌ای را تشکیل می‌دهد که دسترسی غیرمجاز را به‌طور تصاعدی دشوارتر می‌کند.\n\nپروتکل‌های متغیر: کلید امنیت بلندمدت\nاگرچه مهندسی معکوس همیشه در تئوری ممکن به نظر می‌رسد، اما ماهیت پویای پروتکل‌های تنیده و هزینه‌ی بالای آن، این روش حمله را غیرعملی می‌سازد. حتی اگر یک مهاجم موفق به رمزگشایی یکی از پروتکل‌ها شود، باید:\n\nزمان و توان پردازشی قابل‌توجهی را برای رمزگشایی هر لایه‌ی دیگر صرف کند.\nبه‌طور مداوم سازگار شود، چراکه پروتکل‌ها و پارامترهای آن‌ها دائماً تغییر می‌کنند.\nبه این ترتیب، تا زمانی که یک مهاجم بتواند نحوه‌ی عملکرد یک پروتکل را درک کند، نسخه‌ی جدیدی از آن در حال اجرا خواهد بود، و تلاش‌های او را بی‌ثمر می‌کند.\n\nچرا تنیده متن‌باز نیست؟\nبرخلاف برخی از پروژه‌های غیرمتمرکز که از مشارکت‌های متن‌باز بهره می‌برند، تنیده هسته‌ی کد خود را بسته نگه می‌دارد تا مکانیزم‌های امنیتی آن در برابر مهاجمان پنهان بمانند.\n\nاگر کد منبع تنیده عمومی بود، شبکه‌های رباتی می‌توانستند آن را تحلیل کرده و از الگوی ارتباطی آن برای حمله‌ی ربات‌ها استفاده کنند.\nمخفی نگه داشتن پروتکل‌ها تضمین می‌کند که تنها کاربران واقعی قادر به تعامل با شبکه باشند.\nبا این حال، امنیت تنیده فقط متکی بر عدم افشای اطلاعات نیست—بلکه بر پایه‌ی رمزنگاری قوی و اعتبارسنجی غیرمتمرکز بنا شده است، که تضمین می‌کند امنیت شبکه صرفاً فقط بر مبنای لایه‌های پنهان نیست، بلکه یک سیستم دفاعی پویا و تکامل‌پذیر است.\n\nشفافیت در برابر کد منبع بسته\nهمان‌طور که پیش‌تر توضیح دادیم، هسته‌ی تنیده به دلایل امنیتی منبع‌بسته است تا از یکپارچگی پروتکل‌های مقاوم در برابر ربات‌ها محافظت کند. اما ممکن است این پرسش مطرح شود: چگونه کاربران می‌توانند به سیستمی که کد منبع آن در دسترس نیست، اعتماد کنند؟ پاسخ در شفافیت کامل نهفته است—هر فرآیند در تنیده، از ساختارهای رأی‌گیری گسترده گرفته تا تک‌تک آرا، به‌صورت مستقل قابل راستی‌آزمایی است، همان‌طور که در بخش \" درستی و شفافیت انتخابات\" توضیح داده شده است.\n\nکد منبع‌باز عمدتاً برای کاربران فنی مفید است که می‌توانند آن را بررسی کنند، اما شفافیت تنیده برای همه کاربران طراحی شده است. در تنیده، نیازی به دانش فنی عمیق نیست—همه‌ی کاربران می‌توانند نتایج را در لحظه بررسی کنند، از جمله تأیید صحت آرا، اطمینان از عدم اضافه شدن رأی‌های جعلی، یا نظارت بر نتایج انتخابات. اعتماد نه از طریق افشای کد، بلکه از طریق راستی‌آزمایی عمومی تمامی فرآیندهای تنیده شکل می‌گیرد.\n\nچرا تنیده مبتنی بر وب نیست؟\nیکی دیگر از تدابیر امنیتی کلیدی این است که تنیده هیچ‌گاه نسخه‌ی مبتنی بر وب نداشته و نخواهد داشت. دلیل آن پروتکل‌های اختصاصی و رمزآلود تنیده است که به‌طور ویژه برای جلوگیری از اتوماسیون و سوءاستفاده‌ی ربات‌ها طراحی شده‌اند. دسترسی مبتنی بر وب ریسک‌های امنیتی جدی به همراه دارد، زیرا اسکریپت‌های خودکار و ربات‌ها می‌توانند سیستم را هدف قرار دهند.\nبا محدود کردن دسترسی به یک اپلیکیشن موبایلی، تنیده به شکل چشمگیری ریسک نفوذ ربات‌ها را کاهش می‌دهد و تضمین می‌کند که فقط کاربران واقعی در شبکه مشارکت خواهند داشت.",
    "Hp06_05": "پیشنهادات و مشارکت کاربران",
    "Hp06_05_": "تنیده بر اساس حمایت و مشارکت خانواده تنیده به پیشرفت می‌پردازد. ما کاربران را تشویق می‌کنیم که مشکلات را گزارش کنند، بازخوردها را به اشتراک بگذارند و پیشنهاداتی برای بهبود اپلیکیشن ارائه دهند تا کمک کنیم تنیده بهتر شود. بینش‌ها و تجربیات شما در بهبود تنیده و حفظ امنیت، کارایی و سهولت استفاده از آن بی‌قیمت است.\n\nبرای ارسال بازخورد یا گزارش مشکلات، می‌توانید پیام خود را درون اپلیکیشن به آدرس زیر ارسال کنید:\n nqi8mPbzhxhX5KQkl1o0M2JxgiyxFFTlNHfRvFEP7MZHRyQyqJD7WNdRWCCorBxb4v670maguxC0B \n\nگرچه ما همه‌ی مشارکت‌ها را خوش‌آمد می‌گوییم، اما نمی‌توانیم تضمین کنیم که هر پیام خوانده یا اقدامی روی آن صورت گیرد. تنیده پاسخ‌های فردی ارائه نمی‌دهد، مگر در موارد ضروری. با این حال، ما تمام تلاش خود را می‌کنیم تا پیام‌ها را بررسی کنیم، مشکلات را به سرعت برطرف کنیم و پیشنهادات ارزشمند را در صورت امکان پیاده‌سازی کنیم.\n\nتنیده یک پروژه غیرمتمرکز و مبتنی بر کاربران است. این پروژه از طریق تلاش جمعی تکامل می‌یابد و ما از صبر و حمایت کاربران خود قدردانی می‌کنیم. مشارکت شما—خواه از طریق بازخورد، گزارش مشکلات یا خبر دادن به بقیه—به تقویت تنیده کمک می‌کند. از اینکه بخشی از این مسیر هستید، سپاسگزاریم.",
      
    "HelpFinish": "HelpFinish"
}
