{

   "HelpTitleMain_Ht01": "Getting Started",
    "HelpTitleMain_Ht02": "Voting Process",
    "HelpTitleMain_Ht03": "Election Integrity & Transparency",
    "HelpTitleMain_Ht04": "Adding Candidates & Referendums",
    "HelpTitleMain_Ht05": "Messaging & Contacts",
    "HelpTitleMain_Ht06": "Security & Feedback",


    "HelpStart": "HelpStart",
    "Ht01": "Ht01",
    "Hp01_01": "What is Tanideh?",
    "Hp01_01_": "Tanideh is a decentralized, secure, and transparent app that allows users to participate in legitimate polling for elections and referendums. It creates a dynamic \"pulse\" of societal sentiment, providing real-time insights into public opinion. Tanideh operates through a unique client-to-client messaging system, where votes are exchanged directly between users, ensuring privacy and security.\n\nKey Features of Tanideh:\n\nDecentralized Voting:\nTanideh does not rely on central servers. Instead, it distributes all information directly among users. This ensures resilience against manipulation and censorship. Unlike traditional systems, where votes are processed through a centralized authority, in Tanideh participants equally contribute to maintaining and distributing the network. Tanideh enables direct validation of votes by individuals themselves. The entire voting process remains open, verifiable, and free from external control. You can fully verify and tally votes yourself. You have access to all the data to aggregate it by individuals, ensuring the voting process is accurate and transparent.\n\nAnti-Bot Technology:\nTanideh implements security measures to prevent automated bots from manipulating votes. Tanideh uses multilayer protocols to ensure that only real users can vote (More details about these protocols are available in the advanced FAQ section.) To validate the system’s anti-bot claim, the system allows you to interact with other voters, verify their legitimacy, and confirm that votes are authentic—without relying on any central oversight.\n\nPrivacy Protection:\nAll communications in Tanideh are end-to-end encrypted and relayed through multiple nodes to obscure your network identity and your IP address. No single entity—including Tanideh—can track, intercept, or alter your interactions. This ensures a truly private and secure environment where your participation remains anonymous and tamper-proof.\n\nHow It Works:\nWith Tanideh, you can vote in elections, track results in real-time, and even create your own polls. To add a new candidate or referendum, you need to gather enough signatures from other users through the app. This process ensures all polls are legitimate, transparent, and independent of any biases or external influence. Every user has the authority to check the transparency of votes and verify the legitimacy of each one. The process is completely open, giving you the ability to review and validate the results at any time.",
    "Hp01_02": "Who is Tanideh For?",
    "Hp01_02_": "Tanideh is designed for everyone who believes in shaping the future through collective decision-making. Whether you’re a citizen who wants your voice to be heard, an advocate for meaningful change, or someone who values secure and decentralized communication, Tanideh is built for you.\n\nThis app is for individuals who believe their opinions can influence society’s direction. It’s lightweight, easy to use, and requires minimal space on your phone. Even if your primary interest lies in using Tanideh’s secure messaging features, your presence supports the network by distributing and maintaining information.\n\nTanideh’s network thrives on user participation. By staying online, you contribute to the system’s stability and help amplify the people’s voice. The app is highly efficient, consuming only about 35 MB of internet data in 24 hours of continuous use—less than a few social media videos.\n\nIf you have innovative ideas for impactful referendums or candidates, Tanideh empowers you to make a difference. You can create online petitions, gather signatures, and publish them within the app. (More details are available in the \"Adding Candidates & Referendums\" section.) With Tanideh, you have a platform to organize support, amplify your cause, and echo voices globally.",
    "Hp01_03": "Do you process data requests?",
    "Hp01_03_": "At Tanideh, your privacy is our top priority. All messages within the app are protected by end-to-end encryption and peer-to-peer communication, ensuring that your data is only accessible to you and the intended recipient. As a result, there is no centralized data storage, and your messages are not stored anywhere outside of your phone, eliminating the risk of misuse or unauthorized access.\n\nRegarding voting, Tanideh utilizes a decentralized system where votes are distributed across all users. Your vote is not tied to your real identity, phone number, or IP address. This level of security is achieved by encrypting all communications and masking your IP address through multiple relays in the network (More details on using relays are available in the advanced FAQ section.). Therefore, your vote cannot be traced back to you, unless you voluntarily disclose it to others.\n\nIf you're concerned about data removal or takedown requests, it's important to understand that all candidate and referendum information is stored and distributed across the entire user network, rather than in any single or multiple central nodes. This decentralization makes it nearly impossible to remove or erase the information, as targeting one point of the network cannot interrupt the free flow of data. Once information is shared, it becomes public and cannot be retracted unless every user stops using the app.\n\nIn short, Tanideh ensures that your data remains private, secure, and resistant to censorship or tampering. We believe in empowering users with full control over the information within the Tanideh network, ensuring there is no central authority that can access or alter it. By using Tanideh, the truth cannot be silenced.",
    "Hp01_04": "Getting Involved with Tanideh",
    "Hp01_04_": "Tanideh is not just about participation; it’s about shared ownership of a platform that empowers every user. Your involvement goes beyond voting, creating polls, and engaging in the democratic process. Tanideh’s future depends on the collective effort and passion of its users. The more you use it and share it with others, the more power the app gains, and the more your voice will be heard. As we gather votes, the impact grows—helping to build a shared vision for a democratic Iran, where each individual contributes to shaping the future. Every vote counts, every user makes a difference.\n\nTanideh is committed to being free, accessible, and secure for everyone. We are entirely ad-free, and our financial independence allows us to keep the app focused on what matters most—your voice. We don't want ads disrupting your experience, nor do we want corporate interests controlling the platform. Instead, we rely on the support of users like you to sustain and improve Tanideh. If you feel compelled to support our mission, we encourage you to make a donation. Your contribution, no matter how small, helps ensure that Tanideh remains ad-free and continues to grow and improve.\n\nMonero Wallet Address: \nXMR: \n 86Qvk7RuZAQKHYzZk3EF8s9MNDPcGLrLg6sFpFgAnVyDJofMTdYTxoXd9SXKrDiBcUAxvJ3CPTfnyTYirjBXcvU51TCVD7b \n\nBut we don’t stop there. As Tanideh grows, so does the potential to create real change. The future is in our hands, and we invite you to be part of that journey. Spread the word, invite your friends, and let’s build something meaningful together. With your involvement, we can shape the future of Iran.",
    "Ht02": "Ht02",
    "Hp02_01": "Your Tanideh Address",
    "Hp02_01_": "Your Tanideh address is a unique identifier, similar to modern blockchain-based systems. (For more technical details about the specific cryptography and curve used, see the Advanced FAQ.) It consists of two parts: a 77-character public address and a 33-character private \"secret.\" These are automatically generated when you first download the app. Upon opening the app, you can either create a new address or log in with an existing one using your \"secret.\" This ensures decentralized and secure management of addresses without relying on a central authority.\n\nHow Your Tanideh Address Works\nYour public address is visible to others on the network and acts as your identity in the decentralized system. It is used to validate your votes and enable communication with other users. Despite being public, your address is not linked to your real-world identity, ensuring your privacy is protected. If you share your address with friends, they can message you directly through Tanideh without requiring any personal details, such as phone numbers. However, because all votes are transparent and tied to public addresses, others can see your voting choices.\n\nYour \"secret\", on the other hand, is entirely private and should never be shared. It acts as the master key, allowing you to recover your Tanideh address if your phone is lost or the app is deleted. Losing your \"secret\" means permanently losing access to your address, as it cannot be recovered by anyone, including Tanideh.\n\nHow to Access and Secure Your Address\nYou can view both your public address and private \"secret\" in the \"Settings\" section of the app. The characters in your address and secret are derived from a 60-character set, including all numbers and select English alphabets, excluding \"O\" (capital O) and \"I\" (capital I) to avoid confusion.\n\nTo protect your \"secret,\" you can enable a password safeguard in the Settings section. When this feature is active, the app will prompt you to enter a 4-digit password each time you attempt to view your \"secret.\" While this safeguard is optional, enabling it is highly recommended. Be cautious, though—if you forget your password or enter it incorrectly four times, the app will automatically delete all your data, including your address and messages, to protect your privacy.\n\nRecovering Your Address\nIf you lose your phone or reinstall the app, you can recover your Tanideh address by re-entering your \"secret.\" This recovery process happens entirely on your device, without requiring internet access, ensuring only you can regain access. If you are experienced in cryptography, you can also manually regenerate your address using your \"secret.\" However, if your \"secret\" is lost, recovery is impossible. Always store your \"secret\" in a safe, secure location.\n\nKey Points to Remember\n- Public Address (77 characters): Shareable and visible on the network; used for communication and vote validation.\n- Private Secret (33 characters): Non-shareable and critical for account recovery. Treat it like a master key.\n- Security Options: Use the password safeguard to protect against unauthorized access to your \"secret.\"\n- Irreversible Loss: Losing your \"secret\" means permanent loss of your Tanideh address.",
    "Hp02_02": "First Vote, second Vote and numbers",
    "Hp02_02_": "At the top of the navigation bar, you'll find the \"CHOSEN\" section. This area is dedicated to selecting the candidate that represents the people's choice. The candidate at the top of this section is \"The Chosen,” symbolizing the collective voice of the community and holding the highest number of votes.\n\nIn this section, you’ll find two types of votes: First Vote and Second Vote. Here's how they work:\n\nSecond Vote: You can cast this vote for any candidate in the list, showing your general support.\n\nFirst Vote: This is reserved for the top two candidates with the highest number of second votes. You can only cast your first vote for one of these two candidates. This ensures that the candidate labeled as \"The Chosen\" always has at least 50% of the first votes.\n\nThis design allows you to actively support your preferred candidate with your second vote, helping them climb the ranks. At the same time, you can express your preference between the top two rivals by casting your first vote, contributing to the competition for the leading position. Finally, if your candidate reaches the top two, you can align both your first and second votes with the same individual, further solidifying their position.\n\nTo view detailed information about a candidate, click on their profile. You'll find their \"Total Votes,” which reflects the overall number of votes cast for each type. \"Popular Vote\" and \"Percentage\" reflect the candidate's share of the total votes.\n\nIn the \"REFERENDUM\" section, you’ll find active societal questions. Each referendum presents two options, and you are free to vote for one option in any or all of them. These votes help capture societal sentiment on key issues over time, acting as a real-time indicator of public priorities on key topics as public opinion evolves over time.\n\nElections for \"The Chosen\" and certain referendums will not have an expiration date—they remain ongoing, continuously reflecting current and active public sentiment. This strategically empowers people to shape the future while staying connected to evolving societal priorities.",
    "Hp02_03": "How I Can Vote?",
    "Hp02_03_": "To begin the voting process, ensure that the app has stabilized itself on the network. You can check the status message at the top of the screen while on the \"Home\" page. If the app reports network instability, verify your internet connectivity and make sure your phone's time is accurate, as an up-to-date time is essential for your vote to be recognized as legitimate and accepted by other users on the network. For first-time users, a 30-hour waiting period is required before you can cast your initial vote. Once the app has stabilized, you can close it and return after 30 hours to vote, but avoid reinstalling the app during this period, as doing so will reset the stabilization process. This safeguard ensures that no one can bypass the system and vote multiple times within a single vote’s lifetime (see the topic “Why and How Votes Expire?” for more details).\n\nOnce the app is stable, navigate to the candidate or referendum page where you wish to cast your vote. After you cast your vote, the app will sign it using your unique in-app address and the current time (details about this process are covered in the \"Advanced FAQ\" section). The vote will then be relayed through multiple nodes to anonymize your IP address before being presented to the network. Other users in the network will authenticate your vote and keep track of it.\n\nThe result of your vote submission—whether it was successful or not—will be displayed at the bottom of the \"Home\" page. It might take a few minutes for the result to appear, so it’s important to keep your internet connection active and the app open (either in the foreground or background) during this time. Because Tanideh is decentralized, no central server stores your submission status. If your vote fails to send, the app will notify you and give you the option to try again. However, if you lose connectivity before receiving feedback, you will need to wait for the next voting cycle to cast your vote again.\n\nOnce your vote stabilizes on the network, it will take 5 to 20 minutes to be reflected in the polls. From this point onward, even if you go offline, other users will uphold your vote and ensure it remains part of the network. To support the smooth operation of the app, it’s best to keep it running in the background with an active internet connection.\n\nAfter your vote has been successfully published and stabilized, you can verify it using your unique in-app address. This feature ensures transparency and allows you to confirm that your vote has been recorded correctly. For more details, refer to the \"Election Integrity & Transparency\" section of the help center.\n\nThis explanation covers the process of submitting your vote to the network. However, there are important considerations regarding vote expiration, which are explained in the next topic, \"Why and How Votes Expire?\"",
    "Hp02_04": "Why and how votes expire?",
    "Hp02_04_": "The app is designed with robust anti-bot measures, but it is inevitable that some users may attempt to manipulate the system. For instance, casting votes on behalf of others (such as using a relative's phone) or one-time voters who are not engaged with ongoing social issues could compromise the integrity of the polls. To combat this and uphold the app’s mission of accurately reflecting the preferences of the community, votes are set to expire after 30 hours. This ensures that the results remain legitimate and capture the most current and relevant public sentiment.\n\nEach vote has an average life expectancy of 24 hours, and it will expire 30 hours after being cast. You have a 12-hour window, between 18 and 30 hours after your initial vote, during which you can renew your vote without losing its effectiveness. For example, if you cast your vote at 3:00 P.M., you will be able to renew it the following day between 9:00 A.M. and 9:00 P.M. Renewing within this window ensures that your vote remains valid and contributes to the ongoing polling results.\n\nWhen you renew your vote, a new 30-hour cycle begins. For instance, if you renew your vote at 4:00 P.M., your next window for renewal will be between 10:00 A.M. and 10:00 P.M. the following day. Keep in mind that once you renew your vote, the new vote carries a fresh 30-hour period starting from the time of renewal.\n\nEach candidate or referendum page will display three key times:\n\n1. The time when your vote was originally cast.\n2. The time when you can renew your vote.\n3. The time when your current vote will expire if it is not renewed.\n\nIt’s also important to note that new votes may take between 5 to 20 minutes to stabilize within the network. However, there will be no double-counting of votes. When you renew your vote, the most recent vote will replace the previous one, ensuring that only one vote is reflected in the system at any given time. To ensure your vote has a consistent impact on the overall results, make sure to renew it at least 20 minutes before the expiration time.",
    "Ht03": "Ht03",
    "Hp03_01": "Viewing Votes",
    "Hp03_01_": "On every candidate or referendum page, you'll find a button labeled “View Votes” Clicking this button opens a page with a command prompt, asking you to input a “votes spectrum” Currently, this spectrum refers to a voter’s public address. By entering an address, you can search the decentralized network for votes linked to it, offering a transparent and straightforward way to track voting activity.\n\nHow to Use the “View Votes” Feature\nTo check whether a friend has cast a vote, enter their public address into the command prompt. The app will initiate a network-wide search, which may take a few minutes as it gathers and verifies the data. Once the search is complete, the results will appear on the same page. If your friend hasn’t voted, the result will show zero votes associated with their address.\n\nIf your friend has voted—for a candidate or referendum—you can repeat the process 5 to 20 minutes after the vote was submitted. This brief waiting period ensures the vote has stabilized and propagated across the network. Once this is complete, the system will display your friend’s vote, linked to their unique public address. If your friend’s vote expires after 30 hours and you repeat the search, you’ll see zero votes again, as expired votes are automatically removed from the active tally.\n\nTesting the System with Your Own Address\nYou can also test the “View Votes” feature using your own public address. This allows you to verify the transparency of the system and ensure your vote has been successfully disseminated across the decentralized network. Keep in mind that even your own vote isn’t stored on your device; it is distributed through the network. Allow 5 to 20 minutes after voting for the system to process and propagate your vote before initiating a search.\n\nKey Insights About “View Votes”\nThe “View Votes” feature not only ensures that only active votes are counted, but also promotes full transparency by automatically removing expired votes. Votes not renewed within 30 hours of being cast are excluded from results, maintaining accuracy in real time.\n\nMoreover, the “votes spectrum” is not limited to individual addresses. You can expand the spectrum to include broader groups of votes, enabling you to independently analyze and tally results across various voting patterns. This functionality underscores Tanideh’s commitment to transparency, accountability, and empowering users to verify and interpret election data on their own terms. For further details on tallying votes, refer to the topic “Verifying and Analyzing Results.”",
    "Hp03_02": "Verifying and Analyzing Results",
    "Hp03_02_": "In Tanideh, votes are represented by user addresses, each uniquely constructed from a 60-character set. This set includes all numbers and English alphabets, excluding \"O\" (capital O) and \"I\" (capital I) to avoid confusion. This unique address structure ensures that every vote is distinct and traceable, forming a solid foundation for transparency and integrity.\n\nUnderstanding the “Votes Spectrum”\nThe “votes spectrum” allows users to segment and analyze votes using combinations of characters from addresses. For instance, if a candidate’s second vote has 1 million voters, you can break down the total by analyzing subsets of addresses based on their initial characters. By summing votes starting with “a,” “b,” and so forth until all 60 characters are covered, you will arrive at the total of 1 million votes.\n\nThis segmentation goes beyond the first character. You can refine your search further by specifying additional characters, such as “xa” or “sD1.” For example, if you analyze all combinations starting with “xa” (e.g., “xa,” “xb,” ... “x9”) and sum them, the result will match the total obtained by simply searching for “x.” The more detailed your input, the narrower the results. For highly specific inputs, such as a full address (e.g., “sD1eT…”), the system can confirm whether the corresponding vote exists, returning a result of 1 or 0. This flexibility empowers users to analyze voting patterns comprehensively at varying levels of detail.\n\nDetailed Vote Analysis\nIf the number of votes in a given spectrum falls below a threshold (usually fewer than 1,000), Tanideh not only provides the vote count but also lists the individual addresses within that spectrum. This feature delivers unparalleled transparency, enabling users to cross-check voting data down to specific addresses.\n\nFor instance, if you input “sD1” and the network identifies fewer than 1,000 votes in this spectrum, it will display all corresponding addresses along with detailed statistics. This ensures that every vote can be traced and verified, fostering trust in the system’s integrity.\n\nPractical Use Cases for Transparency\nThe “votes spectrum” isn’t confined to individual analysis. Users can expand their queries to cover broader ranges, making it possible to tally votes for a referendum or candidate across larger groups. Just as legitimate elections allow for recounting every ballot, Tanideh’s design ensures that users can recount and verify every vote cast.\n\nThis feature is deeply embedded into Tanideh’s infrastructure, ensuring that election results are not only transparent but also fully auditable. By providing tools for granular analysis and comprehensive verification, Tanideh reaffirms its commitment to accountability and empowers users to engage confidently with the voting process.",
    "Hp03_03": "Messaging Voters",
    "Hp03_03_": "Ensuring Real Voters Behind Every Vote\nNow that votes can be analyzed and verified, the next critical question is ensuring there are actual voters behind each vote. While Tanideh’s advanced anti-bot measures, which prevent fake votes, are detailed in the Advanced FAQ, the platform also provides tools for verifying voters. One such tool is the ability to contact voters through their unique public addresses.\n\nAs explained in the “Verifying and Analyzing Results” topic, narrowing your search within the “votes spectrum” allows you to identify individual voter addresses. By copying an address and pasting it into the messaging page (see more under Messaging & Contacts), you can send a direct message to a voter and inquire about their opinion.\n\nGuidelines for Responsible Messaging\nWhen messaging voters, it’s essential to respect privacy and adhere to Tanideh’s community guidelines. Never request or share personal information, such as names, contact details, or anything that could reveal a voter’s identity. Although Tanideh ensures that your identity and IP address are anonymized, sharing personal details violates the platform's rules and could compromise user safety.\n\nAs a responsible user, refrain from asking others for personal data under any pretext, such as gathering statistics. Similarly, if someone requests your personal information, consider them a bad actor who may be attempting to undermine the app’s security and integrity. Block such addresses immediately (more on this under “Messaging & Contacts”).\n\nBuilding Trust and Transparency Through Messaging\nThe ability to message voters is a powerful tool for fostering transparency and trust in elections. By directly engaging with voters, users can independently verify the authenticity of votes, share insights, and encourage constructive dialogue. This feature ensures that every vote is linked to a real person while maintaining the privacy and security of all users.\n\nIt’s important to approach this feature with a sense of responsibility and respect. Tanideh’s goal is to create a platform where users feel empowered to verify election results without infringing on others’ privacy. Messaging voters should be seen as an opportunity to enhance transparency, not as a means to solicit personal details or cause discomfort.",
    "Ht04": "Ht04",
    "Hp04_01": "Introduction",
    "Hp04_01_": "In any society governed by common sense and collective will, decisions made at the national level reflect the needs and aspirations of the people. Systems like petitioning in Britain—where 100,000 signatures prompt a parliamentary debate—or the United States, where third-party candidates and independent initiatives can appear on ballots after collecting a set number of valid signatures, exemplify the role of grassroots participation in shaping governance.\n\nTanideh adopts a similar democratic ethos, empowering users to propose new candidates or referendums through a decentralized petitioning process. If you believe in a cause, want to nominate a candidate, or initiate a referendum, you can create a petition directly within the app. By securing the required number of signatures within the specified time frame, your proposal will be integrated into Tanideh’s network, enabling the entire community to engage with it.\n\nThis process is fully decentralized. The petition is generated on your device, and once the threshold for valid signatures is met, your device disseminates the petition, where it undergoes automated verification by other users’ devices. If deemed authentic, the petition is integrated into the network and upheld until its expiration date.\n\nAfter the expiration date, no new votes can be cast for the candidate or referendum, and any votes with lifespans extending beyond the expiration date will NOT expire. Any statistical changes during this period may result from the completion of vote dissemination processes that were previously incomplete.\n\nFor three days following expiration, the results remain accessible to all users who had the candidate or referendum added to their network prior to expiration. After this period, the candidate or referendum is fully removed from the network. This ensures a balance of transparency, fairness, and equal opportunity for all users to engage in shaping the issues that matter most.",
    "Hp04_02": "How to Add a Petition",
    "Hp04_02_": "Step 1: Creating Your Petition\nTo create a petition, navigate to the \"CHOSEN\" or \"REFERENDUM\" page. Tap the plus sign at the bottom right of the screen to go to the petition creation page.\n\nHere, you can create a petition for either a candidate or a referendum. Fill out all required fields in Persian and upload a picture for your petition. To ensure the network remains efficient, image sizes are limited to 50 KB.\n\nStep 2: Securing Signatures\nOnce your petition is created, it will only be visible on your device. You’ll see its unique ID and QR code, which you can share with others to gather signatures.\n\nTo successfully establish your petition, you’ll need 100,000 signatures for a referendum or 50,000 signatures for a candidate petition within seven days. If the threshold is not met by the deadline, the petition will automatically be removed from your phone.\n\nWhen gathering signatures, ensure your device is online to receive signatures from other users. If your device is offline, signatures will fail. Due to the decentralized nature of Tanideh and the large number of signatures required, it may be challenging if it’s not impossible for a single device to handle all the traffic within a short time.\n\nTo overcome this, you can keep your petition ID hidden and share it with trusted friends (20–40 people that would be considered \"first layer\"), who can gather signatures on your behalf. These signatures will be routed through their devices and sent back to you.\n\nStep 3: Distributing and Aggregating Signatures\nAfter the first layer of users signs your petition, they will have the same petition on their devices, but with their own unique ID. When they share this ID within their community, a \"second layer\" of users will sign the petition. All new connections would be through their devices and signatures collected in this layer are aggregated on their devices.\n\nThis process distributes the load across multiple devices, ensuring the petition can gather signatures more efficiently. Each new layer can continue gathering signatures, creating a cascade effect. Once the signatures are collected, each layer could send back its gathered signatures to its previous layer. At last the first layer can send them back to your device in batches, with a minimum two-hour interval between each batch.\n\nRemember, only one signature per user will be accepted. All signatures must be aggregated on the original device where the petition was created. Once the required signatures are gathered, your petition will be added to the Tanideh network you just have to keep it online for a few hours so new candidate or referendum would be made available to the entire community.",
    "Hp04_03": "How to Sign the Petition",
    "Hp04_03_": "Step 1: Check the Petition Requirements\n\nBefore signing any petition, make sure that at least 7 days have passed since your first successful stabilization on the network or since your previous petition signing. This requirement prevents abuse and ensures that each signature represents a real person.\n\nStep 2: Find the Petition\n\nTo sign a petition, you first need to determine what the petition is about: Is it for a new candidate or a new referendum?\n\nFor a new candidate, go to the CHOSEN tab.\nFor a referendum, go to the REFERENDUM tab.\nIn either tab, tap the \"+\" sign at the bottom right of your screen to access the petition page.\n\nStep 3: Sign the Petition\n\nOn the petition page, you’ll start in \"Generate\" mode by default. To switch to \"Sign\" mode, tap \"Sign\" in the top left corner of the screen.\n\nYou can sign the petition in one of two ways:\n\nEnter the Petition ID: Copy and paste the petition ID into the text field. Tap away from the field to process it.\nScan the QR Code: Use the built-in scanner to read the petition's QR code.\nIf the ID is valid, you’ll see the petition’s details. Review the petition and, if you support it, tap \"Submit\" to send your signature.\n\nStep 4: Wait for the Signature to Be Processed\n\nYour device will attempt to send your signature to the petition holder. This may take a couple of minutes. If both you and the petition creator are online and successfully stabilized on the network, the signature will be received.\nYou can track the result of your signature on your Home page. Once successful, the petition will appear, without the image, in either the REFERENDUM or CHOSEN tab, depending on its type.\n\nStep 5: Understand the 7-Day Lock\n\nAfter signing a petition, you will be unable to sign any new petitions for the next 7 days. This rule ensures that signatures are not duplicated within a short period, preserving the integrity of the system.\n\nStep 6: Helping the Cause\n\nOnce you’ve signed the petition, your device will create a petition with your own unique ID. If you support the cause, you can share your ID with your inner circle and gather more signatures on behalf of the original petition. As more signatures are collected, they will be added to your petition, and you can track the progress.\n\nWhen you're ready, click “Send New Signs” to send the gathered signatures back to the original petition holder. The system will automatically distinguish new signatures from previous ones and send only the new signatures in batches to the original petition ID. Make sure to set an interval of at least two hours between each batch to avoid network congestion.\n\nRemember, by gathering signatures on behalf of the original petition, you help both the cause and the system’s efficiency by diverting traffic to your device. Make sure all signatures are sent back to the original ID at least one day before the petition expires.",
    "Ht05": "Ht05",
    "Hp05_01": "Introduction to Messaging",
    "Hp05_01_": "Why Tanideh Has Messaging\n\nTanideh is not a traditional messaging app. Instead, its messaging system serves two key purposes:\n\nTransparency – Allowing users to discuss polls and petitions securely within the app.\nExtreme Privacy – Offering a secure, decentralized communication method for users who value privacy over convenience.\n\nHow Messaging Works in Tanideh\n\nTanideh has no central servers. This means messages are not stored anywhere; they can only be exchanged while both sender and receiver are online and connected to the network.\nIf the recipient is offline, your message will not be delivered—there is no way for them to receive it later.\nHowever, if you stay stabilized on the network, for about 25 minutes your app will retry finding your contact within the network and deliver the message.\n\nWhat Makes Tanideh Messaging Different?\n\nNot Tied to Phone Numbers: Instead of using phone numbers, Tanideh uses addresses for messaging. You can only contact someone if you have their Tanideh address.\nMessages Are Relayed Through the Network: A single message does not go directly to your recipient—it may pass through 8 to 10 different users before reaching its destination. This improves privacy by obscuring sender locations.\nText-Only Messaging: Because messages are relayed through multiple users, only text messages are allowed to keep the network efficient.\n\nSecurity & Encryption\n\nEnd-to-End Encryption: Every message is encrypted so that only the sender and recipient can read it—no one else, including users relaying the message, can access its content.\nNo Data Recovery: Messages exist only on your device and your recipient’s device. If you delete the app or a conversation, it cannot be recovered.\nIf you delete a message, it only disappears from your device—it remains on your recipient’s device until they delete it too.",
    "Hp05_02": "How to Send a Message",
    "Hp05_02_": "Messages can only be sent and received when both users are online and stabilized on the network. Follow these steps to send a message:\n\n1. Accessing the Messages Page\nFrom the HOME screen, tap Messages to view your message history.\nTo start a new conversation, tap the message icon in the bottom-right corner.\n\n2. Entering the Recipient’s Address\nYou will be prompted to enter the recipient’s Tanideh address (a 77-character unique identifier).\nYou can manually enter the address, copy-paste it, or scan a QR code if available.\nOnce the address is entered, you can type and send your message—limited to text and standard emojis available on your keyboard—but only if you are stabilized on the network.\n\n3. Message Delivery Status & Timing\nAfter sending a message, a red circular timer appears next to it, indicating that your app is actively attempting to deliver the message.\nMessage delivery attempts last for approximately 25 minutes. If the recipient stabilizes on the network during this time, the message will be delivered.\nIf the message is successfully delivered, the red circle changes to a double tick (✔✔), confirming that it has reached the recipient’s inbox. However, this does not confirm if they have read it.\nIf delivery fails after 25 minutes, the red circle turns into a red exclamation mark (❗), meaning no further attempts will be made.\n\n4. Sending Messages Efficiently\nSend one message first and wait for confirmation before sending additional messages. This ensures your recipient is online and prevents unnecessary failed deliveries.\nIf you exit the app before the message status updates, the red circular timer will remain indefinitely. This means the message might have been delivered, but you won’t receive confirmation because you disconnected from the network before the status could update.\n\n5. Blocking Unwanted Contacts\nIf you block a user, they will no longer be able to find you on the network, and none of their messages will reach you.\nYou can manage your blocked contacts from the Settings section, where you also have the option to unblock users if needed.",
    "Hp05_03": "Managing Your Contacts",
    "Hp05_03_": "To manage your contacts in Tanideh, start by navigating to the Contacts screen from the Home screen. Here, you will see a list of all your contacts. At the bottom right, you'll find the person plus icon. Tap on it to add a new contact.\n\nYou will need to enter the contact's name and address. You can either manually type the 77-character address or scan the QR code to input it quickly. Once added, the new contact will appear in your contacts list.\n\nYour address is automatically added as your first contact in the system.\n\nViewing and Managing Contacts\n\nBy tapping on any contact in your list, you will be able to see their address and share their QR code with others. If you want to message them directly, simply click the message icon.\nTo delete a contact, tap on the three-dot icon in the top-right corner of their contact details screen. This will open the options menu, where you can choose to delete the contact from your list.",
    "Ht06": "Ht06",
    "Hp06_01": "Stabilization & Network Participation",
    "Hp06_01_": "Ensuring Network Stabilization\n\nWhen you open Tanideh, the app immediately attempts to stabilize itself on the network. This process ensures that your device can communicate securely with other users and participate in the decentralized voting system. For stabilization on the network, your phone clock should be at least almost up to date. You will see a countdown timer on the Home screen indicating this process.\n\nIf the app successfully establishes the necessary connections before the timer runs out, you will be stabilized on the network, allowing you to cast votes, receive updates, and interact with the system seamlessly. If stabilization fails due to network issues or restrictions, the countdown will be replaced by a refresh button, allowing you to manually retry the process.\n\nYour Role in Network Participation\n\nTanideh is a community-driven app, meaning it relies on users keeping their app active to maintain a strong, decentralized network. Even after casting your vote, keeping the app open in the background with an internet connection helps sustain the network's flow of information.\n\nIn times of network restrictions or attacks, active participation becomes even more crucial. The more users remain online, the stronger and more resilient the network becomes.\n\nMinimal Resource Usage, Maximum Impact\n\nDespite its critical role in decentralization, Tanideh is designed to be lightweight and efficient. Running the app continuously consumes only around 35 MB of data per day (less than a single Instagram refresh) and has little to no impact on battery life.\n\nTo optimize data usage, the app does not automatically retry stabilization if the connection is lost. Instead, the refresh button will appear, prompting you to manually restore stabilization when needed. Checking the app occasionally and pressing refresh when required helps keep the network running smoothly.\n\nTanideh strikes a balance between user-friendly efficiency and community-driven participation—it asks for minimal resources but relies on your engagement to ensure a truly decentralized and secure system.",
    "Hp06_02": "Cryptography in Tanideh (Advance Topic)",
    "Hp06_02_": "The Strength of Tanideh Addresses\n\nEach user in Tanideh is identified by a Tanideh Address, which is derived from an EdDSA (Edwards-Curve Digital Signature Algorithm) public key using the ed448 curve. This choice offers 224-bit security, significantly stronger than the 128-bit security found in many common digital signatures.\n\nWhy was Ed448 chosen?\nQuantum Resistance – Among classical cryptographic curves, Ed448 is expected to be one of the last to be broken by quantum computers due to the higher computational stability it demands.\nIndependence from NSA Influence – Unlike some widely used cryptographic standards such as ECDSA, Ed448 was not introduced by the NSA, addressing concerns about potential backdoors in government-associated encryption standards.\n\nThis makes Tanideh Addresses both future-proof and independently trustworthy.\n\nEnd-to-End Encryption & Secure Handshake in Tanideh\n\nTanideh ensures that all communications are encrypted from sender to receiver using a secure, two-step handshake process.\n\nStep 1: Key Exchange with ECDH (Elliptic Curve Diffie-Hellman)\n\nEach connection in Tanideh begins with a key exchange based on ECDH (Elliptic Curve Diffie-Hellman) using the X448 curve. This curve was chosen because:\n\nIt is faster than many alternatives.\nIts 224-bit security level surpasses most other options, ensuring superior protection.\n\nAt this stage, both ends generate a shared secret that will later be used for encryption. However, there is a critical security question:\nHow can we ensure that no third party (a \"man-in-the-middle\") is intercepting these keys?\n\nStep 2: Authentication with EdDSA Signatures\n\nTo prevent man-in-the-middle attacks, the Tanideh Address plays a crucial role in verifying the handshake.\n\nEvery element of the key exchange process is hashed and digitally signed using the user's EdDSA private key.\nThe receiving party verifies this signature against the sender’s Tanideh Address to confirm authenticity.\n\nTo ensure cryptographic strength, Tanideh avoids compromised hashing algorithms like SHA-1. Instead, SHA-512 is the primary hash function, with occasional use of SHA-256 for efficiency in specific scenarios.\n\nEncryption for Ongoing Communication\n\nOnce the handshake is completed, the ECDH shared key is converted into a 256-bit AES-GCM symmetric key.\n\nAES-256 GCM is selected because it is widely recognized as virtually unbreakable and is the standard in modern TLS encryption.\nThe key is never transmitted over the network, ensuring that only the two communicating parties have access to it.\n\nThis means that every message, every vote, and every interaction within Tanideh remains completely private and protected against interception.",
    "Hp06_03": "Layered Relays in Tanideh (Advance Topic)",
    "Hp06_03_": "How Traditional Onion Routing Works\n\nIn traditional onion-routing networks like Tor, a user’s connection is relayed through three encrypted nodes before reaching its destination.\n\nThe guard relay knows the user’s IP but not the final destination.\nThe middle relay(s) pass encrypted data, ensuring the guard relay doesn’t learn the destination.\nThe exit relay knows the final destination but not the original user.\n\nThis ensures that no single node has enough information to trace both the sender and the recipient, preserving anonymity.\n\nWhy Tanideh Needs a More Advanced Approach\n\nTanideh is different from traditional onion networks because:\n\nThere is no fixed central server—users communicate directly with each other, not just with websites.\nBoth the sender and receiver must remain anonymous, unlike Tor, where the destination (a website) is known by the exit relay.\n\nTo solve this, Tanideh expands onion routing into a fully symmetrical layered relay system.\n\nHow Layered Relays Work in Tanideh\n\nEach user in Tanideh is represented by an exit relay, which is the only node that knows their Tanideh address. Meanwhile, their guard relay is the only node that knows their IP.\n\nBetween these two, 2-3 middle relays act as additional layers, ensuring:\n\nNo single relay knows both the user’s identity and their communication partner.\nEven if one relay is compromised, it cannot expose the full connection.\n\nThis means that when two users communicate, their messages travel through 8-10 relays (including the middle relays of both users), ensuring complete anonymity.\n\nWhy Tanideh Uses Only Text Messages\n\nWith a network of 8-10 relays per message, routing data efficiently is crucial. To maintain speed, security, and anonymity, Tanideh only allows text-based communication.\n\nLarger media files would slow down the network and increase the risk of traffic pattern analysis.\nText messages ensure fast, efficient, and truly private communication.",
    "Hp06_04": "Bot Proof Protocols (Advance Topic)",
    "Hp06_04_": "Ensuring a bot-free environment is critical to Tanideh's integrity. Unlike traditional networks, where central authorities impose verification measures, Tanideh relies on a community-driven approach and dynamic network protocols to eliminate bots and prevent system abuse.\n\nCommunity-Based Validation\nThe first layer of bot resistance in Tanideh is its community validation mechanism. Every address and its corresponding vote undergo collective verification by participants in the network. This ensures that only legitimate users influence polls, making automated manipulation impractical.\n\nWhile this approach prevents fake votes, another challenge remains: preventing bots from flooding the network with fake addresses.\n\nCustom Protocols as a Defense Against Automated Attacks\nUnlike conventional networks that rely on widely known protocols like HTTP or WebSocket, Tanideh operates on its own custom-built communication protocols. These protocols are not publicly documented and are designed to be difficult to reverse-engineer.\n\nAn attacker attempting to infiltrate the network would face multiple layers of evolving protocols—each with dynamic parameters that adapt over time. These include:\n\nConnection Establishment Protocols – Governing how nodes communicate securely.\nAddress Discovery Protocols – Regulating how users find each other while maintaining privacy.\nVote Propagation Protocols – Ensuring votes are distributed securely and cannot be manipulated.\nEach protocol relies on the successful execution of the previous one, forming a multi-stage security model that makes unauthorized participation exponentially more difficult.\n\nEvolving Protocols: The Key to Long-Term Security\nWhile reverse engineering is always a theoretical possibility, the high cost and dynamic nature of Tanideh's protocols render this attack vector impractical. Even if an adversary manages to decode one protocol, they would need to:\n\nInvest significant time and computational power to decode each layer.\nAdapt continuously as protocols evolve and their parameters shift.\nThis means that by the time an attacker understands how one protocol works, a new version is already in place, rendering their efforts futile.\n\nWhy Tanideh is Not Open Source\nUnlike some decentralized projects that rely on open-source contributions, Tanideh maintains a closed-source core to keep its security mechanisms obscured from potential attackers.\n\nIf the source code were public, bot networks could study, analyze, and imitate the protocols.\nKeeping protocols undisclosed ensures that only legitimate participants can engage with the network.\nHowever, Tanideh’s trustworthiness does not rely on secrecy alone—its anti-bot measures are rooted in strong cryptography and decentralized validation, ensuring that security is not based on mere obscurity but on robust, evolving defenses.\n\nTransparency vs. Closed-Source Code\nAs we explained earlier, Tanideh’s core is closed-source for security reasons, ensuring the integrity of its bot-resistant protocols. However, one might ask: How can users trust a system if they cannot access its source code? The answer lies in radical transparency—every process in Tanideh, from large-scale voting structures to individual votes, is independently verifiable, as explained in Election Integrity & Transparency.\n\nOpen-source code mainly benefits technical users who can inspect it, but Tanideh’s transparency is designed for everyone. Instead of requiring deep technical knowledge, Tanideh allows all users to verify results in real time—whether by checking vote integrity, confirming that no extra ballots have been added, or auditing election outcomes. Trust is built not by revealing the code, but by making every action within Tanideh publicly verifiable.\n\nWhy Tanideh is Not Web-Based\nAnother fundamental security measure is that Tanideh does not and will not have a web-based interface. This is due to its cryptic and proprietary protocols, which are specifically designed to prevent automation and bot exploitation. Web access introduces significant vulnerabilities, as automated scripts and bots could attempt to infiltrate the system. By restricting access to a mobile-only application, Tanideh greatly minimizes these risks, ensuring that only real users will participate in the network.",
    "Hp06_05": "Reporting Issues & Providing Feedback",
    "Hp06_05_": "Tanideh thrives on the support and involvement of its community. We encourage users to report issues, share feedback, and suggest improvements to help make the app better. Your insights and experiences are invaluable in refining Tanideh and ensuring it remains a secure, effective, and user-friendly platform.\n\nFor all feedback and issue reports, you can send a message within the app to the following Tanideh address:\n nqi8mPbzhxhX5KQkl1o0M2JxgiyxFFTlNHfRvFEP7MZHRyQyqJD7WNdRWCCorBxb4v670maguxC0B \n\nWhile we welcome all contributions, we cannot guarantee that every message will be read or acted upon. Tanideh does not provide individual responses except in essential cases. However, we do our best to review messages, address issues as efficiently as possible, and implement valuable suggestions when feasible.\n\nTanideh is a decentralized and community-driven project. It evolves through collective effort, and we appreciate the patience and support of our users. Your participation—whether through feedback, reporting, or spreading the word—helps Tanideh grow stronger. Thank you for being part of this journey.",
 
    "HelpFinish": "HelpFinish"

}
